{"doc_key": "Twenty killed and at least 74 injured in spate of shootings across US over the weekend", "sentences": "Investigators works the scene of a shooting in Fairfield Township, N.J., Sunday, May 23, 2021 (AP Photo/Matt Rourke)\nTwenty people were killed and at least 74 injured in a spate of shootings across the United States over the weekend.\nPolice in Chicago say that in their city alone 36 people were shot, eight fatally, including a 15-year-old boy, since Friday night.\nViolence also broke out in Minneapolis, Minnesota, in the early hours of Saturday morning when two people were killed and eight injured in an altercation outside a nightclub.\nThis was followed by a string of shootings in New Jersey, South Carolina, Georgia and Ohio.\nPolice say that the Minneapolis killings took place when two men standing in a crowd exchanged words, pulled out guns and fired at each other.\nWhen police arrived at the incident they found an “exceptionally chaotic scene”, with multiple gunshot victims on the ground, according to 5ABC.\nOne of the gunmen, who has not been identified, was killed, along with Charlie Johnson, a recent graduate of the University of St Thomas School of Engineering.\nThe second alleged gunman, Jowan Contrail Carroll, 23, was arrested on probable cause of murder, according to the Bloomington Police Department.\nThree men and five women were among the injured, with one of the victims reportedly in critical condition.\nTwo people were killed and 12 injured at a shooting at a 90s-themed party in Fairfield Township, New Jersey, on Saturday night.\nA 30-year-old man and a 25-year-old woman, who have not yet been named, were both killed when gunfire broke out.\nPolice say they have not made any arrest in the case and the investigation is ongoing.\nA 16-year-old girl was killed and seven others were injured in a shooting on Saturday night at Bicentennial Park in Columbus, Ohio, police said.\nFive victims were taken to hospital but are expected to survive, and two others sustained non-gunshot injuries fleeing the scene.\nAuthorities said the shooting took place at a private event that had been promoted on social media.\nA 14-year-old boy was killed and 14 others were injured during a shooting at an unauthorised concert in North Charleston, South Carolina, on Saturday night.\nStory continues\nNorth Charleston Police Deputy Chief Scott Deckard said that the shooting took place after a fight broke out near the concert stage.\nPolice have not released information on any suspects in the case.\nThree people were killed and five injured in the early hours of Sunday morning in a shooting outside a bar in Youngstown, Ohio.\nOfficials say that one of the shootings happened in the bar “but they stemmed from an incident which began there” and officers found a “chaotic and tragic” scene.\nPolice say they have not made any arrests but investigators have spoken to several people, but htye have not released details on how many weapons were used in the shooting.\n“It is not easy for me to get the call in the middle of the night from the chief or one of his team to tell me about incidents like this, and it pains me,” said Mayor Jamael Tito Brown.\nPolice in the Atlanta area found three people shot to death in a condominium building after they responded to reports of gunshots early on Sunday morning.\nOfficials in South Fulton say that all three victims died at the scene but police have not released any details on suspects in the case or a motivation for the triple slaying.", "url": "https://www.yahoo.com/news/twenty-killed-least-74-injured-201535477.html", "date_published": "2021-05-23 20:15:35"}
{"doc_key": "Law enforcement officers in pursuit of murder suspect wanted after week-long manhunt in Chester County", "sentences": "Advertisement Law enforcement officers in pursuit of murder suspect wanted after week-long manhunt in Chester County Tyler Terry is suspected of committing four murders in two states Share Shares Copy Link Copy\nChester County deputies and other law enforcement officers are actively pursuing the “armed and dangerous” murder suspect who has been accused in at least four homicides over multiple states.Tyler Terry has been on the run since last Monday, opening up a manhunt in South Carolina that has now reached six days.The Chester County Sheriff’s Office says they are after the suspect in the Highway 9 and Richburg Road area in Chester County.The road has been shut down.Deputies are asking the public in the area to lock their doors, secure their firearms, stay inside and report suspicious activity.Terry is accused of multiple murders, including at least two in South Carolina, and two in St. Louis, Missouri.The hunt caused MUSC Health - Lancaster Medical Center to go on lockdown Saturday night through early Sunday morning “out of an abundance of caution.”According to the Chester County Sheriff’s Office, law enforcement officers are searching in the area of Ernandez Road, Highway 223, Highway 9, and Highway 901 and are maintaining a heavy presence in Richburg and Fort Lawn areas.“If you have a loved one, kin or friends in the Richburg area, please try to contact them to check in. If you cannot contact them, let us know and we will try to make contact. Additionally, if you have property here and are on vacation, contact us and we will check on it,” the Chester County Sheriff’s Office said.A look at Tyler Terry’s past gives people a better glimpse of why law enforcement is calling him so dangerous.”He’s as violent of a person as I’ve ever encountered,” says Sheriff Max Dorsey of Chester County Sheriff’s Office.Those words coming from a sheriff who has been in this business for more than 20 years. This comes after at least four alleged murders, seven more alleged attempted murders and several gun charges.For Dorsey, the danger started the second he says his deputies were shot at.\"All of those deputies escaped injury or death by the skin of their teeth,” Dorsey said. “It doesn’t get anymore revealing about how dangerous someone is than that incident.”Looking through Terry’s criminal history could reveal it though. Not just in South Carolina, but in North Carolina as well.In 2019, deputies arrested Terry for assaulting Adrienne Simpson. The arrest report details a violent attack -- that Terry hit Simpson in the back with a machete and punched her several times.A little over a year ago, Chester County deputies arrested Terry for first-degree domestic violence. Terry is accused of hitting Simpson so hard, she lost hearing in her right ear and her eye was swollen shut.Just a month ago, Myrtle Beach Police arrested Terry for third-degree domestic violence when Simpson told police Terry broke her phone and injured her hand.”This is a dangerous person who we know is armed,” Dorsey said. “We’re focusing all of our resources to catch him.”Terry, accused of shooting at deputies during a chase, has been spotted in Chester County and is confirmed to be armed, deputies say. Friday, deputies said they “more than doubled” their manpower in the search for Terry and were expanding the search perimeter beyond Fishing creek and closer to Fort Lawn.Officials with Chester County Sheriff’s Office said that more than 120 people were included in the search efforts.Members of SLED, the ATF, FBI, and York County Sheriff’s Office were also assisting with the help of dogs and helicopters.“It’s been pretty crazy there’s been a lot of law enforcement around seems like everyone’s staying in their house and waiting to see what happens next,” said Tyler McElfresh who lives in Chester County. Deputies said Thursday that Terry was accused in a theft in Fort Lawn, where surveillance showed Terry was armed. An employee at Carolina Earth Movers says Terry stole shoes, a shirt, a drink, and a gun from a truck that was unlocked and parked on the property.Terry has been on the run since Monday night, according to deputies, and is believed to be on foot.Since the search started Monday, investigators have linked Terry to a killing in York County and two other Chester County shootings all this month as well as two shooting deaths in Missouri, the Associated Press reports.", "url": "https://www.wyff4.com/article/deputies-pursuing-wanted-manhunt-suspect/36511938", "date_published": "2021-05-23 20:10:00"}
{"doc_key": "Pakistan wants Afghanistan to break off ties with India", "sentences": "Kabul [Afghanistan], May 24 (ANI): Amid the US drawdown from Afghanistan, former president Hamid Karzai in an interview to a German publication has explained how Pakistan 'would like' Afghanistan to break off relations with India and exert strategic influence in the country through the Taliban.\nWhile speaking with Der Spiegel, Karzai said the Pakistani offensive is in full swing right now and there is fighting going on.\n\"Pakistan actually would like Afghanistan to break off relations with India. That is impossible. If we give in to this, we would give up our sovereignty and independence. If we want to send our police or our army or our boys and girls to India for training because it is good for our country, we should do so,\" the former president said.\n\"Pakistan wants to exert strategic influence in Afghanistan through the Taliban. This traces back to fears related to the legacy of British colonial rule in the region,\" he added.\nKarzai said that Pakistan must know that it cannot win by force as dominating Afghanistan from the outside has never worked.\n\"It didn't work for the British, it didn't work for the Soviets, and it didn't work for the United States, even with all of its resources. And the Pakistanis will not succeed either,\" he said while asking Pakistan to be reasonable and begin a civilized relationship between our two neighbours.\nHe also revealed how he realized early into my tenure as president that this war is not our conflict, and we Afghans are just being used against each other.\n\"After September 11, 2001, terrorist attacks in the US, Washington took the historic opportunity to pursue its global ambitions in Afghanistan. Just look at our position on the map. Afghanistan is the most strategically important place in today's global contest for supremacy. At the same time, Pakistan started using the Taliban to further its own agenda in Afghanistan.\"Karzai hoped that the Taliban will stand up to foreign influences where necessary. \"My appeal to Afghans, including the Taliban, is that we come together and finally take our fate into our own hands against all foreign powers.\"Afghanistan has seen a spike in the incidents of violence in recent weeks, leading to casualties of Afghan security forces and civilians. US withdrawal is underway and set to complete by September 11.\nAccording to a report, heavy clashes is continuing in the five provinces including Baghlan, Helmand, Kunduz, Kandahar and Laghman, over the last few weeks. (ANI)", "url": "https://www.middleeaststar.com/news/269608606/pakistan-wants-afghanistan-to-break-off-ties-with-india", "date_published": "2021-05-28 00:00:00"}
{"doc_key": "Man shot Sunday on Aries Road in Arlington", "sentences": "The shooting happened in the 900 block of Aries Road, according to the JSO.\nJACKSONVILLE, Florida — One person is injured after a shooting Sunday afternoon in Jacksonville's Arlington area.\nSeveral people were gathered outside a home in the 900 block of Aries Road. At about 3:20 p.m., a person drove near the group in what is believed to be a gold Acura and opened fire, according to the Jacksonville Sheriff's Office.\nOne adult male was hurt in the shooting. First responders took the man to the hospital with non-life-threatening injuries, police said.\nPolice are searching for the car they believe the shooter was driving. Police said the Acura may have had a missing license plate and a broken passenger side window.", "url": "https://www.firstcoastnews.com/article/news/local/jso-responded-to-reported-shooting-in-arlington-area/77-035a111f-5300-428d-9b9b-bca6d5f20e73", "date_published": "2021-05-23 16:32:00"}
{"doc_key": "Congo volcano leaves death and smoking wreckage, but major city spared", "sentences": "Goma was thrown into panic on Saturday evening as Mount Nyiragongo, one of the world's most active and dangerous volcanoes, erupted, turning the night sky an eerie red and sending a wall of orange lava downhill towards the lakeside city of about 2 million people.\nArmy spokesman Guillaume Njike said 13 were killed fleeing the disaster, including nine in a traffic accident and four who tried to escape Munzenze prison in Goma.\nThat figure will likely rise considerably. A Reuters reporter saw two people killed by the initial eruption in a village north of Goma, and witnesses spoke of dead and missing relatives.\nHaunted by memories of an eruption in 2002 that killed 250 people and left 120,000 homeless, residents fled on foot with their belongings, some towards the nearby border with Rwanda.\nThe International Federation of Red Cross said that between 3,000 and 5,000 fled into Rwanda on Saturday, many of them peasants and farmers with livestock. Some began returning on Sunday.\nThe eruption was caused when fractures opened in the volcano's side, causing lava flows in various directions.\nAs the sun rose on Sunday a smouldering black gash about half a mile wide could be seen on the outskirts of Goma, where the lava had cooled to rubble.\nAt some points it was three storeys high, engulfing even large buildings and sending smoke into the grey morning sky.\nResidents in the Buhene district sorted through the mangled white remains of tin roofs or lifted rocks - tiny individual efforts in what will likely be a months-long campaign to restore the zone.\nElsewhere, groups of people posed for photos on the steaming lava.\n\"I CURSE THIS DAY\"\nSome said they had lost family members.\nErnestine Kabuo, 68, said she had tried to carry her sick husband from their house as the lava approached, but he was too unwell to leave.\n\"I said to myself, I can't go alone, we've been married for the best and for the worst,\" said Kabuo, walking in a daze and crying, surrounded by buildings swallowed by lava.\n\"I went back to at least try to get him out but couldn't. I ran away and he got burned inside. I don't know what to do. I curse this day.\"\nThe flow towards Goma stopped a few hundred meters from the city limits. The nearby airport was untouched. A separate lava flow that headed east over unpopulated terrain towards Rwanda also appeared to have stopped.\n\"Local authorities who have been monitoring the eruption overnight report that the lava flow has lost intensity,\" government spokesman Patrick Muyaya said on Twitter on Sunday.\nStill, authorities warned that the danger was not over and that seismic activity in the area could cause further lava flows.\nLava crossed a main road out of Goma overnight, cutting it off from cities to the north. Traffic was in gridlock in most places as people tried to leave or return to assess the damage to their homes.\nExperts were worried that the volcanic activity observed in the past five years at Nyiragongo mirrors that in the years preceding eruptions in 1977 and 2002.\nVolcanologists at the OVG, which monitors Nyiragongo, have struggled to make basic checks on a regular basis since the World Bank cut funding amid embezzlement allegations.\nFrom October 2020 to April, the observatory could not carry out comprehensive seismic checks on the volcano because analysts lacked an internet connection, OVG's scientific director Celestin Kasereka Mahinda told local Radio Okapi on Sunday.\nInternet was restored in April thanks to funding from a U.S. partner, he said, but by that stage too much time had been lost.\n\"As soon as the internet was restored, we had started recording the warning signals, but since we did not have previous data, we thought it was the start of volcanic activity. Hence this surprise.\"", "url": "https://bdnews24.com/world/2021/05/24/congo-volcano-leaves-death-and-smoking-wreckage-but-major-city-spared", "date_published": "2021-05-24 00:00:00"}
{"doc_key": "Palestinians Jubilant After Israel-Hamas Agree To Egyptian-Brokered Ceasefire Friday", "sentences": "Share This\nBy Janet Ekstract\nISTANBUL (TURKISH JOURNAL) – Palestinians took to the streets across all territories to celebrate the ceasefire agreed to between Israel and Hamas that officially began at 2:00 AM local time in the Middle East. After a flurry of behind-the-scenes diplomacy and extensive negotiations brokered primarily by Egypt with Qatar – the Israeli Cabinet agreed to the ceasefire with Hamas. Israel told the press that Egypt proposed the ceasefire agreement and is “mutual and unconditional.” A Hamas official referred to the ceasefire agreement as a “mutual and simultaneous truce.” Hundreds of Palestinians celebrated in the streets with fireworks at the news of the ceasefire that ended the 11-day conflict in Gaza. The Egyptian-brokered ceasefire has been welcomed by all sides concerned about the conflict and will be under scrutiny in coming weeks.\nUN Secretary-General Antonio Guterres welcomed news of the ceasefire but made it clear that both sides needed to return to dialogue to resolve the root cause of the conflict. Guterres said: “I call on all sides to keep the ceasefire.” The secretary-general also said that “an integrated, robust package of support” is planned to assist the Palestinians in Gaza, adding that both leaders “have a responsibility to start dialogue.” Meanwhile, on Thursday in an emergency session of the UN General Assembly (UNGA) on the issue of Palestine and the conflict, Palestinian Foreign Minister Riyad Al- Maliki urged the international community to “stop the massacre.” Guterres said the lives of children in Gaza had become “a hell on earth” and warned of a deepening humanitarian crisis. The Qatari Foreign Minister commented it was the failure of the international community to act, that damaged UN credibility. The UN General Assembly President said that Israel’s actions were “inhumane and unbearable” and an assault on the Palestinians. Palestinian President Mahmoud Abbas accused Israel of “organized state terror” while Turkish Foreign Minister Mevlut Cavusoglu said: “We will not remain silent in the face of unspeakable atrocities and brutality.”\nIn a press briefing at the White House on Thursday night, U.S. President Joe Biden welcomed the ceasefire and commented “The U.S. is committed to working with the UN and other international stakeholders to provide rapid international assistance” to help the Palestinians working with the Palestinian Authority. Biden initially received backlash for the U.S. being the only UN Security Council member to block a joint statement on the conflict. He also was under pressure from at least 25 democratic senators, numerous domestic and international organizations who urged him to take immediate action to halt the violence in Gaza as well as demand a halt to evictions of Palestinians from their homes.\nMeanwhile, the UN reported that 75,000 Palestinians have been displaced in Gaza and that nearly half of all deaths were women and children with 1,900 wounded and 232 Palestinians killed in Israel’s 11-day bombardment of Gaza. At least 16,800 residential properties were destroyed with another 1,800 properties in need of major repairs, according to the Gaza Authority. Guterres warned that the humanitarian crisis is worsening in Gaza with depletion of food, water and medicine dangerously low. The World Health Organization (WHO) reported that Gaza’s healthcare system was completely destroyed without any ability to handle the COVID pandemic in the region and WHO has made an urgent appeal for 7M USD in assistance for Gaza.\nIn order to ensure the ceasefire holds, Egypt said it will be sending its own delegation to Israel, the West Bank and Gaza to monitor the ceasefire. In a further bid to secure a lasting peace, the Biden administration said that Secretary of State Anthony Blinken will be going to the Middle East to pursue a peace agreement with all regional players. The UN Human Rights Council will meet in a special session on May 27 to discuss the issue of Palestine.", "url": "http://www.turkishjournal.com/2021/05/23/eye-on-libya-libya-on-precipice-as-foreign-armed-presence-continues/", "date_published": "2021-05-23 00:00:00"}
{"doc_key": "RIVERS: APC Criticize PDP For Holding Rally On Day Of Mourning Attahiru, Others", "sentences": "By Davies Iheamnachor, Port-Harcourt The All Progressives Congress, APC, has expressed shock over the decision of the Peoples Democratic Party, PDP, in Rivers State to organize a political event on a day of national mourning.\nAPC in a statement in Port Harcourt by its Spokesman, Chief Ogbonna Nwuke, noted that despite the sorrowful mood that the nation was thrown into as a result of the sudden death of the Chief of Army Staff and 10 other gallant officers, Governor Nyesom Wike allowed his team to engage in aimless politicking.\nNwuke said that the decision to televise such an event was an act of great disrespect for the nation’s fallen heroes who were buried the same day, Saturday.\nHe said: “The APC would have overlooked the charade which took place in the Rivers capital; an event which was broadcast on television; if the Wike administration did not create the impression, through a senseless jamboree, that the Rivers people are insensitive.\nALSO READ: Gen Attahiru: CAN Youth Wing declares three-day mourning “We are truly shocked that Governor Nyesom Wike, a Head of Government who is a prime beneficiary of the effort that members of the Armed Forces are making to keep him and the good people of Rivers State safe, could go ahead with a pre-planned reception intended to receive a handful of “bread and butter” politicians.\n“Across the country, events planned for the weekend were shifted in order to enable Nigerians pay their last respect to our fallen heroes who died in an air crash in Kaduna.\n“While the nation mourned the death of its officers, Wike and his colleagues in Rivers State took to the rostrum to show that politics is a more important reflection than appreciating the grief of heartbroken Nigerians.”\nALSO READ: Driving against traffic: Lagos impounds 10 vehicles on International Airport Road Nwuke said the rally was an act of callousness on the side of the PDP and however, expressed condolences to the families of the fallen heroes who died on the line of duty.\nHe exonerated the Minister of Transportation and former governor of the state, Chibuike Amaechi, of allegations of sales of state’s assets, questioning Wike on why he has failed to prosecute Amaechi.\nHe said: “We ask Governor Wike to explain why he is finding it difficult to prosecute a man who is not covered by immunity at this time for his alleged crimes while in office as Governor? Why is Governor Wike unable to accept the findings of a panel of Inquiry that was set up by him which exonerated Rt. Hon. Rotimi Amaechi before he was sworn in as Minister of Transportation?\n“People who are guilty are not tried in the court of public opinion. They are tried in open courts that are duly constituted. Wike should lead the prosecution team to court if he is sure of his facts, or halt the penchant for peddling worthless, inaccurate, and cheap accusations.”\nVanguard News Nigeria\nLike this: Like Loading...", "url": "https://thestreetjournal.org/2021/05/rivers-apc-criticize-pdp-for-holding-rally-on-day-of-mourning-attahiru-others/", "date_published": "2021-05-23 16:45:00"}
{"doc_key": "40% of residents fully vaccinated, state data shows", "sentences": "CLOSE\nFour in ten Wisconsinites are fully vaccinated, state data shows.\nAs of Sunday, 40.9% of residents have had both shots of the Pfizer-BioNTech or Moderna vaccines or the single dose of the Johnson & Johnson vaccine, according to the state Department of Health Services.\nAbout 14% of adolescents between ages 12 to 15 have received a shot of a COVID-19 vaccine, which is about 42,000 people, DHS recorded.\nThe number of weekly vaccines administered has continued to fall since it peaked the week of April 4 of around 425,000 doses given. Between May 9 and May 15, about 167,000 shots were administered, according to DHS.\nThe seven-day average of daily doses stood at 22,055 as of Sunday.\nRELATED: What to know about Wisconsin's vaccine plan, who's eligible and where to get it\nRELATED: A labor camp, a Super 8 and a long bus ride home: What happened when COVID-19 hit migrant workers at a Wisconsin canning plant\nCOVID-19 numbers\nNew cases reported: 147\n147 New deaths reported: 0\n0 Number hospitalized (as of Saturday): 242 (intensive care: 70); down 22 from a month ago\n242 (intensive care: 70); down 22 from a month ago Seven-day average of daily cases: 324 (down 471 from a month ago)\n324 (down 471 from a month ago) Seven-day average of daily deaths: 4 (down 1 from a month ago)\n4 (down 1 from a month ago) Total cases since the start of pandemic: 608,432\n608,432 Active cases: 6,055\n6,055 Total deaths: 6,989\nVaccine numbers\nTotal doses administered: 5,044,653\n5,044,653 Doses administered Saturday: 11,495\n11,495 Wisconsin residents with at least one dose: 2,723,373\n2,723,373 Residents who are fully vaccinated: 2,381,053\n2,381,053 Residents 65 and older with at least one dose: 841,912\nRELATED: A camp cook, a store owner, a devoted father: The stories of migrant workers at a Wisconsin canning plant who died of COVID\nContact Benita Mathew at bmathew@gannett.com. Follow her on Twitter at @benita_mathew.\nRead or Share this story: https://www.greenbaypressgazette.com/story/news/2021/05/23/40-residents-fully-vaccinated-state-data-shows/5234132001/", "url": "https://www.greenbaypressgazette.com/story/news/2021/05/23/40-residents-fully-vaccinated-state-data-shows/5234132001/", "date_published": "2021-05-23 20:05:23"}
{"doc_key": "Monica Lewinsky sets social media ablaze with ‘perfect’ Twitter response", "sentences": "Monica Lewinsky has issued a hilarious response to a tweet asking “what’s the most high-risk, low-reward thing you’ve ever done?”\nThe former White House intern under President Bill Clinton replied simply with an eyeball emoji.\nSeveral social media users signalled appreciation for Lewinsky’s sense of humour.\n“Kinda perfect tweet,” creator of the popular Dilbert comic strip Scott Adams wrote.\n“This wins the day,” another replied.\n“I laughed out loud and thank you for it,” another person replied.\nA number of other users declared that Lewinsky had “won Twitter” for the day.\nOthers posted memes of Clinton, who was impeached for lying about his affair with Lewinsky, who was then a White House intern.\nRELATED: Star cast as Lewinsky in new TV series\nmedia_camera Monica Lewinsky. Picture: VALERIE MACON / AFP.\nIt’s not the first time she has poked fun at the incident on Twitter either.\nLast year, Lewinsky raised eyebrows with a risqué crack about her time as a White House intern, taking on the viral “I have a joke” Twitter trend.\nThe challenge revolved around describing why you can’t tell the joke itself, often relating to a specific profession.\nFor example, TV writer Nell Scovell offered: “I have a Charles Manson joke and it kills.”\nIndian film director Gautham Menon chimed in with: “I have an epidemiology joke but it hasn’t yet gone viral”, while Dr Karishma Kaushik posted: “I have a microbiology joke, but not sure if it is ‘cultured’.”\nmedia_camera Lewinsky talking with Mr Clinton at a 1996 Washington DC event.\nBut many Twitter users are convinced Ms Lewinsky won the challenge, thanks to her transparent reference to the Clinton affair.\n“I have an intern joke and it … never mind,” she wrote.\nActor Mia Farrow was one of hundreds of thousands of social media users who appreciated the joke, replying: “Monica wins the internet.”\nWild author Cheryl Strayed was also full of praise, tweeting: “You are so good.”\nMs Lewinsky has a long track record of X-rated jokes relating to the sex scandal.\nIn July 2019, she similarly took to Twitter to respond to a post that asked the twitterverse for “the worst career advice you’ve ever received”.\nmedia_camera Lewinsky in 1998. media_camera She was a White House intern at the time of the affair.\nResponding to a tweet posted by organisation psychologist and author Adam Grant, Ms Lewinsky posted: “An internship at the White House will be amazing on your resume.”\nMs Lewinsky famously had an affair with US President Bill Clinton from November 1995 until March 1997.\nIt resulted in his impeachment for lying under oath and obstruction of justice after he initially denied having “sexual relations” with her.\nThis article originally appeared on Fox News and was reproduced with permission\nOriginally published as Lewinsky tweet sets social media ablaze", "url": "https://www.cairnspost.com.au/monica-lewinsky-sets-social-media-ablaze-with-perfect-response-to-highrisk-lowreward-question/news-story/20cac1f2d24d449997892df050cb183f?nk=1756cd5361756cc483aa36ee42f34064-1621802799", "date_published": "2021-05-22 06:25:00"}
{"doc_key": "Israel, Gaza and the Changing Nature of Warfare", "sentences": "I was asked by family abroad what is going on so I decided to write it out. It may help me make sense for myself also. I’ll start with a general disclaimer that this is not meant to be a comprehensive history leading up to the current situation. Rather, it is an overview of internal and external factors that were influencing the fighting we just experienced. I will be going through a variety of aspects here. It is the total sum of it all that gives this round its character. Some things are more significant than others. Make no mistake this was not spontaneous.\nFor those who might read this and not know me, I am an American born Israeli (here since 1969), a Jew, have spent 45 years dealing with security mainly in the IDF reserves and the Police, and have 30 years of experience practicing and teaching conflict resolution, peace education, second track diplomacy and development. I have developed and implemented many Israeli Palestinian projects and multi-national peace projects. Projects for youth and adults, projects implemented in Gaza and the West Bank and around the world. Projects for women’s empowerment through micro financing, projects in sports, music, academia, and myriad other methodologies.\nPalestinian Politics:\nVery briefly the main players are: Mahmoud Abbas, better known as Abu Mazen who is the successor of Yasser Arafat. He leads the Fatah faction which is the largest faction of the Palestinian Liberation Organization – PLO. It is a secular, socialist party. They control the West Bank. Hamas which controls Gaza – is a theocratic political party affiliated with the Muslim Brotherhood.\nThe Palestinian National Authority = PNA\nMahmoud Abbas, the President of the PNA called for elections in Palestine. Elections that are over a decade overdue. He then cancelled them. Why? Officially because Israel would not let the Palestinians in Jerusalem participate (the blame Israel tactic). From a practical point of view, it’s because he understood he would lose. Hamas thought they could win in the West Bank, as they did in Gaza in 2006, and are frustrated that this has been taken from them. Hamas complained but utilized the opportunity to claim the title of the protector of Jerusalem.\nHamas:\nOn Thursday May 8th I listened to a podcast by Elior HaLevi, a political analyst who explained what the course of action of Hamas would be the following week and the connection to the dates of Lil al Qadr, which coincides with Jerusalem day, and the holiday of Id el Fitir. For those not familiar with the religious meaning in Islam, the days from Lil Al Qadr till the end of Ramadan are days during which the heavens open, sins are forgiven and wishes granted, these days are the peak of Ramadan. Hamas planned to utilize all this symbolism to garnish political support. Hamas shot seven missiles at Jerusalem and miscalculated Israel’s response. The podcast was 90% correct from the point of view that it was planned and what it goals were, but wrong in Israel’s response and Hamas’s response to that. The Hamas end game is not clear, even if 100% of its rockets hit Israel, then what? What does it want to achieve, realistically?\nThe Arab World:\nIf you have been following the politics in the Middle East over the last few months, you probably know that Gulf States have signed agreements with Israel and have started diplomatic and economic relations. The Palestinians have realized that they are being sidelined and are no longer the focal point of the political process in the Middle East. This undercuts the power and economic base of all Palestinian politicians, and they are eager to change this process. Fatah has a greater chance of merging into the process since it is a secular political movement, Hamas cannot and will not join such a process as it is dedicated to the destruction of the State of Israel and is a religious fundamentalist party. This flare-up serves Hamas’s wider Arab political agenda.\nIran:\nIran manifests its will via proxies as can be seen in Lebanon, Iraq, Yemen, Argentina and Gaza. Iran just had joint exercises with Russia and China and signed a very large military agreement with China. Iran is like-minded to Hamas in that it is a theocratic, totalitarian regime and its whole frame of reference is such. Its interest is twofold. First, it gets the support of the Arab body politic, the masses. Why? Because Shia Islam sees itself as the rightful leader of the Muslim world and for that to happen they need the support of the Arab masses. Supporting Hamas which is fighting Israel and inserting Jerusalem in the equation gives it some leverage. The second is the negotiations with the West. Iran needs the West to understand that no one will sleep well if they don’t get what they want.\nIsraeli Politics:\nThis security situation plays into the hands of Bibi Netanyahu. He did not create it, but he benefits from it in the short run. Netanyahu has invested great efforts in persuading the Israeli public that he is “The Protector of Israel”. His electoral base is right wing and nationalist. He has managed to alienate himself from some natural political partners, right wing parties that are fed up with him and his style of leadership, which has created the political stalemate that is actually threatening his rule, and extrapolated from that, brings him closer to a full investigation and maybe a conviction. Over the years, Netanyahu has played an elaborate game of sleight of hand. On one hand exacerbating ethnic discord and disregard for the police and the judicial system while not outright calling for civil disobedience and insurrection. On the other hand, he came very close to making a deal with the Islamist Arab political party Ra’am, that some of his supporters saw as betrayal, as he has told them thousands of times that Arabs cannot be trusted. This in-fighting serves Bibi well. I do not want to think he orchestrated it with intention, but it seems like each side maneuvered in such a way as to help create this mess.\nUS Politics:\nThe region saw Donald Trump’s administration change the rules of the local political game. It provided some benefits, such as speeding up the Abraham Accords, which would have happened anyhow, although within a different construct, and taking Iran to task not just for its nuclear program but for its involvement in regional destabilization. Joe Biden’s presidency seems to be perceived as a return to the Obama legacy, which the more moderate west leaning countries of the Middle East saw as abandonment and exposed the fickleness of US support. Iran itself, and through its more expendable proxies, is literally testing the waters, as can been seen through the violent naval encounter between the US Navy and Iranian boats and the seizing of weapons sent by Iran to Yemen. From the Iranian point of view, Hamas is more expendable than Hezbollah. The first is Sunni, the latter Shia, like Iran. Hezbollah is in a precarious situation in Lebanon as the port explosion has angered the average Lebanese populace, and Iran “owes” Hezbollah for its service in the Syrian civil war. Hezbollah is the poster child of exporting the revolution. This is all part of the Middle East chess game and this round is part and parcel of all sides trying to see if there is a true realignment or just a little shuffle of the chairs.\nThe Changing Nature of Warfare:\nAnyone who reads military or defense journals will know that one of the biggest issues facing militaries around the world is the changing nature of warfare. Some of the jargon is familiar such as “shock and awe” or “multi-dimensional or multi domain warfare,” “low intensity conflict,” “asymmetric warfare,” and “war amongst the people”. The last, coined by General Sir Rupert Smith, speaks of moving the conflict into the cities where the weaker side has an advantage. Militaries around the world have different ways of dealing with it. Russia just flattens whatever it deems necessary. Syria uses everything at its disposal with complete disregard for casualties. The western democracies are struggling. They are struggling because they would like to uphold the laws of warfare. They are democracies and are under scrutiny of their public. Because the media has become a defining part of the battlefield. What we are witnessing now is the latest stage in developing strategies. The fighting in 2014 escalated over a period of time and lasted 51 days. This implies a lot more room for error and misery on all sides as the fighting drags on. Israel this time decided to do the opposite. Hamas started shooting and Israel responded with 100% effort. The reasoning behind it is to destroy assets, destroy command and control centers, take out the major players and the fighting will end quicker with less overall damage. Those readers who follow military issues, understand the equation. For those of you less familiar with military issues, the use of overwhelming force (or threat of force) is what ends a conflict. Think of the Cold War – no one started a nuclear war since everyone understood what the result would be.\nI would like to mention two more issues. The first is the search for a balance in casualties, as heard in the press and social media. This is an interesting concept but not really a valid one. All militaries in any and all conflicts in history prefer that the opposing combatant force suffer more than their own. The parents of the sons and daughters of any given force expect their commanders to impose more damage on the enemy than on their children and no one would accept an explanation that your son died because we had to keep an even score. But if we look at just one prolonged battle, the battle of Fallujah in 2004, the US suffered 27 fatalities, the insurgents 200 and about 600 civilians. In the second battle the numbers rose to coalition 110, insurgents 3,000 and thousands of civilians. That’s what happens when a militia challenges an army. Israel has a law that every building being built in Israel must have a safe room. Hamas has dug scores of kilometers of military tunnels in Gaza. If they are so busy digging tunnels why not designate some of them as civilian bomb shelters? Israel warns people by cell phone, by ‘roof knocking” with an inert projectile and only then attacks buildings where civilians are not likely to be present. This is a particular and peculiar IDF methodology.\nThe second, which relates to the first, is the issue of targeting. Hamas clearly states that it is aiming at Israeli cities, which means, by definition, the desire to indiscriminately kill Israeli civilians. Hamas does not claim to be shooting at military targets. Israel is using precision munitions and while there is collateral damage and casualties, that is exactly what it is: collateral unintended damage, which is very regrettable. Anyone who adds the word “but” to Hamas targeting of its missiles, is bending the rules of logic and morality and loses any moral high ground they might think they occupy.\nInternal unrest:\nOne of the most disturbing aspects of this conflict is the civil unrest and rioting in the streets by both Jewish and Muslim youth. First let’s acknowledge that anyone who perpetrates indiscriminate violence on any one else is a thug. Period.\nThe Arab Israeli conflict is a century old and has left many deep scars on both populations. Riots occurred before in 1921, 1929 and the great Arab Revolt against the British in 1936-39. In all the past eruptions of hostilities in 67, 73, 82 and so on, the local Arab public, citizens of Israel, did not riot. So what’s new? For the past 20 years, more or less, we have had a right wing nationalist government that either tolerated racism or encouraged it. The symbolic apex was the Nation State Law passed in 2018. Into the cauldron of a society on the verge, pour in the fact that the police, since the first Intifada have been overextended and enforcement of normal law and order has been sporadic and in some areas, like the Negev, nonexistent. Then add the fact that the Israel Police Force were – solely for political reasons – without a chief for over a year and the country has not had a budget for two years. The same government has been screaming in the media and demonstrations that the police are the tool of the ruling elites (neglecting to remember who has been in power almost two decades) and are trying to topple an elected government along with accusing the judicial system of being biased. This is a recipe for social unrest and a weakened enforcement system. The Arab body politic, which has been marginalized in the political process, saw a glimmer of hope with all political sides willing to negotiate with Ra’am and maybe get real political clout; expectations were raised, only to be dashed.\nLast but not least, COVID-19. People have been locked up for a year and a half. Many aspects of society and the social contract that we took for granted have become almost irrelevant. Take frustration, unclear perspectives for the future, mix in fear with incitement on social media and voila! You have social unrest. Make no mistake – every single last one of those people should be arrested and have the maximum penalty under the law “awarded” them regardless of their religious background or ethnicity. I would add that every one of them that wrapped themselves in an Israeli flag while rioting and attacking random people should be tried for desecration of national symbols. I have not fought for 45 years for the flag for a hoodlum to use it as an excuse for delinquency.\nNow to all the above add:\nThe issue of Sheikh Jarrah, which has been going on since 1875 and is a hot issue, so hot in fact that it has been in the courts for decades. It is a legal issue. An issue of ownership and who gets to claim ownership within this conflict, of rent not paid for decades and of interested parties adding a nationalistic narrative.\nFor more information you might want to look at: https://www.wsj.com/articles/almost-nothing-youve-heard-about-evictions-in-jerusalem-is-true-11621019410?st=l06gfjdr48p09fg\nIt is being cynically used for political gain, as is the tension around Jerusalem on Ramadan and Jerusalem day, with political players trying to gain points in the Middle East chess game for the internal politics of the Palestinians and the Israeli coalition government as it is being negotiated.\nSocial media played a significant part as a “TikTok” challenge that was going around with young Arabs beating up Jews in Jerusalem while filming and sharing it on TikTok. The response came in the form of street fights with extreme radical Jewish Lahava group. Hamas called on young Muslims to barricade themselves on Haram El Sharif/Temple Mount and then a baseless rumor spread that radical Jews were about to storm the hill. This incited the Arabs on the hill who started to throw stones at the police who responded with riot control measures such as tear gas and flash bang grenades. In order to calm down the storm, the Israeli police forbid any Jews from going up to the Temple Mount on Jerusalem day. But the fumes were present in the air and all converged to create this perfect storm.\nSo what can be done?", "url": "https://blogs.timesofisrael.com/israel-gaza-and-the-changing-nature-of-warfare/", "date_published": "2021-05-23 22:30:00"}
{"doc_key": "How many people are vaccinated?", "sentences": "Waynesboro has administered more than 18,278 doses of the COVID-19 vaccine, as of May 17, according to data from the Virginia Department of Health.\nThat's up 3% from the previous week's tally of 17,677 COVID-19 doses administered.\nIn Waynesboro, 40% of people living in Waynesboro city are fully vaccinated as of May 17. The Centers for Disease Control and Prevention considers someone fully vaccinated two weeks after they've been given a single-dose shot (Johnson & Johnson) or a second shot (either Pfizer or Moderna).\nVirginia reported 670,456 total cases of coronavirus, an increase of 0.52% from the week before.\nThe five counties with the highest percentage of their population fully vaccinated in Virginia as of May 17 are Goochland County (52%), Albemarle County (51%), Lancaster County (48%), James City County (48%) and Northampton County (47%).\nHere are the latest numbers on COVID-19 vaccinations in Waynesboro city as of May 17:\nHow many people in Waynesboro have received a COVID-19 vaccine?\n48% of people in Waynesboro have received at least one dose of the vaccine, for a total of 10,519 people\n40% of people in Waynesboro are fully vaccinated, for a total of 8,801 people\nFor a county-by-county look at the vaccination rollout, see our COVID-19 vaccine tracker, which is updated daily.\nHow many people in Virginia have been vaccinated so far?\n52% of people in Virginia have received at least one dose of the vaccine, for a total of 4,396,825 people\n41% of people in Virginia are fully vaccinated, for a total of 3,465,698 people\nWe pull data on local vaccine distribution on a weekly basis. Check back for our next weekly update mid-week for the latest numbers.\nCorpus Christi and Nueces County Public Health District administers the Pfizer COVID-19 vaccine to children 12-18 years old at the Greenwood Senior Center on Friday, May 14, 2021. (Courtney Sacco/Caller-Times) (Photo: Courtney Sacco/Caller-Times)\nRead or Share this story: https://www.newsleader.com/story/news/2021/05/23/gda-covid-19-vaccine-2021-05-19-va-psta-51820/116387184/", "url": "https://www.newsleader.com/story/news/2021/05/23/gda-covid-19-vaccine-2021-05-19-va-psta-51820/116387184/", "date_published": "2021-05-23 20:17:37"}
{"doc_key": "Two dead in shooting at NJ house party", "sentences": "The New Jersey State Police said two people are dead and 12 others are injured after a shooting at a house party on Saturday.\nPolice said in a statement on Facebook that they responded to a home in Fairfield Township around 11:50 p.m. and discovered a 30-year-old man and 25-year-old woman dead.\nState Police Investigating Shooting in Cumberland County, 14 Shot and 2 Confirmed Deaths\nThe NJSP is investigating a fatal shooting that killed a man and a woman and injured 12 others at a residential party in Cumberland County last night.\nhttps://t.co/3Bnfk0M7HS pic.twitter.com/48jhOLTNd8 — NJSP - State Police (@NJSP) May 23, 2021\nADVERTISEMENT\nPolice also discovered 12 other victims who were suffering from injuries, with one of the victims in critical condition, according to the police statement. All were sent to a nearby hospital.\nNew Jersey Gov. Phil Murphy (D) on Sunday urged residents of the state to help police by sharing any information they know about the shooting.\n\"We urge anyone with information to step forward, so those responsible can be brought to justice. This remains an active investigation with many moving parts. More information will be released as it is available and confirmed,\" Murphy said in his statement.\nSince late last night, the @NJSP and county and local law enforcement in Cumberland County have been investigating the horrific mass shooting at a large house party in Fairfield Township that attracted hundreds of party-goers. pic.twitter.com/zA2dRvJ9Dq — Governor Phil Murphy (@GovMurphy) May 23, 2021\nThe New Jersey State Police said no arrests have been made and that the motive behind the shooting remains unclear. They are still investigating the shooting.", "url": "https://thehill.com/homenews/state-watch/554987-two-dead-in-shooting-at-nj-house-party", "date_published": "2021-05-23 16:22:52"}
{"doc_key": "Trans man found dead in QC; childhood friend, 2 others charged", "sentences": "Charges have been filed against three suspects in the murder and alleged rape of a transgender man, which has been called a “hate crime” by an LGBTQ advocacy group.\nPhilippine National Police chief Gen. Guillermo Eleazar said on Sunday that the suspects in the death of Ebeng Mayor were identified by the Quezon City police as Zander Dela Cruz, Joel Loyola and Richard Elvin Araza.\nADVERTISEMENT\nThe victim’s phone was recovered from the suspects who were charged on Saturday with rape with homicide and robbery in the city prosecutor’s office.\nDespite the filing of a rape case and the suspects’ confession, the police were still waiting for the results of an autopsy to determine if Mayor had indeed been assaulted before he was killed.\nAn additional charge of illegal possession of firearms was also filed against Loyola.\n“To the family of Ebeng, I know that we cannot bring [Mayor] back but with the PNP’s kept promise of bringing [his] killers to justice, we hope that this somehow lessens the pain of your loss,” Eleazar said in a statement.\nMissing for 3 days\nAfter going missing for three days, Mayor was found dead on May 20 in an empty lot at Sitio Bakal, Barangay Bagong Silangan, Quezon City. A piece of wood had been thrust into the victim’s genitals.\nPursuing a lead from a witness who had identified Dela Cruz as the last person to be seen with the victim, the police questioned the suspect who happened to be Mayor’s close childhood friend.\nHe then confessed to the crime and identified his accomplices who were also arrested.\nBased on the suspects’ testimonies, they went out drinking with the victim until the early morning of May 18.\nOn the way home, still drunk, Loyola said he punched Mayor until the latter lost consciousness. They then took the victim to a vacant lot where they assaulted him.\nADVERTISEMENT\nWhen Mayor came to, the three hit his head with a rock “to silence him,” according to Police Maj. Elmer Monsalve, city police investigation chief.\n“Then after they took off [Mayor’s] clothes, not content with raping him, they then stuck a 12-inch wooden stick into his genitalia before leaving him there,” he said.\nVictim unrecognizable\nWhen Mayor’s body was discovered days later, the victim’s skull was crushed while his face was unrecognizable.\nMonsalve said they believed the skull-bashing was the cause of Mayor’s death as Eleazar added that they had yet to get the results of the suspects’ drug tests.\nAccording to LGBTQ advocacy group Bahaghari, all the evidence in the case “pointed to a hate crime.”\nOther LGBT groups like Bahaghari and Metro Manila Pride (MMP) said Mayor’s death was emblematic of the Duterte administration’s continued failure to protect the vulnerable community, especially after the President granted absolute pardon last year to US Marine Joseph Pemberton who killed trans woman Jennifer Laude in 2014.\n“Amid the pandemic, acts of discrimination are not at all reduced but intensified—from Duterte’s militaristic lockdown schemes to the release of murderer Pemberton from imprisonment—it is clear that this regime has no remorse for LGBTQ members,” Bahaghari said in a statement.\nJustice for Mayor, the group added, could only happen through the immediate passage of a national legislation seeking to address the country’s violently discriminatory culture.\nSogie equality bill\n“As we seek justice for Ebeng, we also demand accountability from the current administration, headed by President Duterte, that has unwaveringly perpetuated the culture of violence against the LGBT+,” Bahaghari said. “We have not forgotten the scheming, flip-flopping position of Duterte on the Sogie (sexual orientation and gender identity and expression) equality bill that has languished for 21 years in Congress, his military lockdowns that have further enabled authorities to arrest, abuse and sexually violate members of the LGBT+ community,” it stressed.\nEchoing Bahaghari’s sentiments, MMP called on Congress and for all city councils to pass antidiscrimination policies immediately, and for the public to “listen intently and amplify the voices of the trans community.”\nIn a statement, Quezon City Mayor Joy Belmonte “strongly denounced the atrocious and barbaric act against a member of the LGBT community” during Pride Month as she assured Mayor’s family of assistance.\n“We encourage members of the LGBT sector who are experiencing violence and harassment to report to our hotlines for immediate action or seek refuge in our Kanlungan shelters if the need arises,” she said. INQ\nRead Next", "url": "https://newsinfo.inquirer.net/1435675/trans-man-found-dead-in-qc-childhood-friend-2-others-charged", "date_published": "2021-05-24 04:41:00"}
{"doc_key": "Some protests, but most students happy to leave UT with live ceremony", "sentences": "One year later, UT's live graduation ceremony was a return (kind of) to normalcy\nAlexx Montanez, a University of Texas cheerleader and Puerto Rican native who went to high school in Cedar Park, says that a few months ago, having an in-person graduation seemed so unlikely that she wasn’t going to buy her regalia.\nThat changed over spring break, when UT announced that it would host the first large-scale, in-person commencement ceremony since the coronavirus pandemic began.\nOn Saturday night, Montanez and her twin sister, Amanda, were decked out in traditional graduation gowns and caps to join nearly 10,000 other graduates at Royal-Memorial Stadium for an event that's usually held on the south lawn of the UT Tower.\nTexas President Jay Hartzell led the 138th annual ceremonies, which last year took place virtually because of the pandemic.\n“Isn’t it great to be back together in this venue? Isn’t it good to see people without a screen and a mute button?” he told a cheering crowd of students, many of whom hadn’t been around their classmates all year. (Masks were neither required nor worn by most attendees.)\nHartzell noted that of the 9,855 spring graduates, 13 were making history as the first graduates of the UT Dell Medical School.\nStudent body class president Anagha Kikkeri shared some of the lessons she learned from her family and applied to her time at UT.\n“What was hard to bear is sweet to remember,” Kikkeri said, remembering that Hurricane Harvey hit just as she and her classmates were starting their first semester in 2017.\nA few years later, they pioneered a new form of virtual learning when the pandemic started and endured the state’s record freeze in February. It has been unprecedented in every way, she said.\nMore: UT diversity and inclusion work takes toll on Black faculty, students, staff\nAlthough the recent upheaval over “The Eyes of Texas” wasn’t mentioned by name, Kikkeri, UT's first female Indian student body president, described the racism that she endured during her youth, when she wasn’t “Indian enough” and wasn’t “American enough” either.\n“You can’t change the wind, but you can change the sails,” she said.\nKikkeri ended with a quote from the Bhagavad Gita: “What belongs to you today belonged to someone yesterday and will be someone else's tomorrow. Change is the law of the universe.”\nDisney executive Bob Iger, whose son was among the graduates, didn't speak directly to the \"Eyes\" controversy either, but urged the students to take risks for what's right.\n“Our world is changing faster than we thought possible,\" he said. \"If there was ever a time for you to be bold, it is now.”\nIger used the movies “Coco” and “Black Panther” as examples of “bold decisions” that led to significant changes in our culture and society.\n“The only way to accomplish meaningful things is to take swift action and stand in courage when confronted with tough and unpopular choices. Recognize the collective power of bold actions,” he said.\nAt the end of the ceremony, students from every section, including several doctoral and graduate students who were seated on the field, walked toward the exits to leave early when “The Eyes of Texas” started playing over the speakers.\nSome of them, like Victoria Garcia, were doing it in protest of the song.\n“It was really offensive to a lot of my fellow peers, and I felt like I had an obligation to stand with them,” Garcia said after the ceremony. “I’m in social work, so people being discriminated against is something I’m always going to be fighting against.”\nJonathan Pavia, an Austin native who graduated with a biochemistry degree, said he stayed through the song even though he thinks it should be eliminated from school functions.\n“Even if slavery is long gone, it’s still something that hits home for a lot of people,” Pavia said. “I think that giving UT the most inclusive and unifying name is what’s best. If it doesn’t affect you, that doesn’t mean it doesn’t affect other people.”\nMore: In overnight vote, Texas Senate approves bill limiting how race, racism can be taught in public school classrooms\nJohn Gomez, an electrical engineering graduate, said he’d heard about the protest too. Although he is against the continued use of the song, his family had traveled from Colombia to attend.\n“I wanted to make the most out of (the ceremony), and staying to the end was important for them and for me,\" Gomez said. \"I understand its racist roots, and there’s undergoing change to fix that, but it wasn’t enough to influence my decision to walk out.”\nIris Hernandez, a government major from Amarillo, was not aware of the walkout over the song. She was just happy to have finished 437 days of an unprecedented college experience.\nHernandez said getting to virtual classes became harder as the year went on, and Saturday was the first time she met many of her classmates in person.", "url": "https://www.statesman.com/story/news/2021/05/23/some-protests-but-most-students-happy-leave-ut-live-ceremony/5209844001/", "date_published": "2021-05-23 20:23:59"}
{"doc_key": "Provinces shift vaccination efforts to teens and younger adults as rollout advances", "sentences": "Share this Story: Provinces shift vaccination efforts to teens and younger adults as rollout advances\nProvinces shift vaccination efforts to teens and younger adults as rollout advances\nArticle content A day after Canada officially reported partially immunizing 50 per cent of residents against COVID-19, more provinces stepped up efforts to add younger age groups to the vaccinated ranks. Ontario on Sunday became the latest province to open vaccine appointments to kids 12 and over through the province’s booking system. We apologize, but this video has failed to load.\ntap here to see other videos from our team. Try refreshing your browser, or Provinces shift vaccination efforts to teens and younger adults as rollout advances Back to video Those wanting to book can do so through the provincial online portal or call centre, as well as through pharmacies offering the Pfizer-BioNTech shot, the province said. While some youth had previously been able to obtain a vaccine through pop-up clinics or initiatives spearheaded by regional public health units, Sunday’s news made access more equitable across the province. In Quebec, there were long lineups outside a walk-in vaccine centre in Montreal that opened its doors to the 12 to 17 age group over the weekend. The province will formally open its booking system to youth 12 and up on Tuesday, but a spokesman for the local health authority said officials at the clinic west of downtown decided not to turn away teens that showed up for walk-ins. By 2 p.m., the clinic reported it was out of available doses for the day, despite having ordered 500 extra to meet demand.\nAdvertisement Story continues below This advertisement has not loaded yet, but your article continues below.\nArticle content Efforts to target younger residents came amid a general acceleration in the national immunization drive. Canada’s chief public health officer wrote on Twitter on Sunday that more than 2.5 million Canadians received a dose of a COVID-19 vaccine between May 9 and May 15. More than 19 million Canadians, or half the national population, had received at least an initial dose of vaccine as of Saturday, though less than five per cent have been fully immunized with two shots. Several other provinces have already expanded vaccine eligibility to those 12 and over, including Newfoundland and Labrador, Saskatchewan, Manitoba and Alberta. As provinces worked to inoculate young people, Saskatchewan announced Sunday that it was also stepping up efforts to get seniors their second doses.\nAdvertisement Story continues below This advertisement has not loaded yet, but your article continues below.\nArticle content The Saskatchewan Health Authority reported that as of Monday, anyone 80 and over can book a second dose, along with cancer and organ transplant patients and those who were vaccinated on or before March 1. Nationally, new COVID-19 cases continued to trend below the third-wave peaks reported in mid-April, although case counts remained high in several provinces. Manitoba reported 461 new COVID-19 infections and one additional death as the five-day test-positivity rate remained high at 14.5 per cent provincially and 16.7 per cent in Winnipeg. Newfoundland and Labrador reported 23 new confirmed cases of COVID-19, up sharply from the four reported a day earlier. The province is currently grappling with a cluster in the Central Health region.\nAdvertisement Story continues below This advertisement has not loaded yet, but your article continues below.\nArticle content Provincial public health authorities advised against nonessential travel in and out of the part of the province between Lewisporte and Summerford in an effort to limit further spread. Nova Scotia reported 74 new cases as well as its 78th and 79th death of the pandemic in what Premier Iain Rankin described as a “tragic weekend” for the province. “The hearts of all Nova Scotians are with the families and friends who are grieving the loss of loved ones,” he said in a statement. “Please make decisions this weekend that help stop the spread of this virus so we can prevent more Nova Scotians from having to experience such grief.” The province’s chief medical officer of health said Nova Scotia had reported five deaths in the last three days — a statistic that hits hard in the small, tight-knit province. The situation appeared more hopeful in Ontario and Quebec, where cases have been slowly declining from third-wave highs. Ontario reported just under 1,700 new cases, while Quebec fell below the 500 mark for the first time since last September. Saskatchewan reported 116 new cases and one additional death on Sunday, while New Brunswick reported 14 new cases. Alberta, meanwhile, counted 563 added cases and six more deaths. This report by The Canadian Press was first published May 23, 2021\nShare this article in your social network\nAdvertisement Story continues below This advertisement has not loaded yet, but your article continues below.\nShopping essentials Advertisement Story continues below This advertisement has not loaded yet, but your article continues below.\nNP Posted Sign up to receive the daily top stories from the National Post, a division of Postmedia Network Inc. Email Address There was an error, please provide a valid email address. By clicking on the sign up button you consent to receive the above newsletter from Postmedia Network Inc. You may unsubscribe any time by clicking on the unsubscribe link at the bottom of our emails. Postmedia Network Inc. | 365 Bloor Street East, Toronto, Ontario, M4W 3L4 | 416-383-2300 Thanks for signing up! A welcome email is on its way. If you don't see it please check your junk folder. The next issue of NP Posted will soon be in your inbox. We encountered an issue signing you up. Please try again\nTrending", "url": "https://nationalpost.com/pmn/news-pmn/canada-news-pmn/provinces-shif-vaccination-efforts-to-teens-and-younger-adults-as-rollout-advances", "date_published": "2021-05-23 18:37:00"}
{"doc_key": "Trump votes in Arizona recounted by Cyber Ninjaa firm", "sentences": "In early March, a Boston-based vote-counting firm called Clear Ballot Group sent a bid to Arizona’s state Senate to audit the 2020 presidential election results in Maricopa County.\nThe firm has conducted more than 200 such audits over 13 years in business. “Our level of comparison data is unmatched,” Keir Holeman, a Clear Ballot Group vice president, wrote to the Republican-controlled Senate. He never heard back, he says.\nInstead, the state Senate hired a small Florida-based cyber security firm known as Cyber Ninjas that had not placed a formal bid for the contract and had no experience with election audits. Senate President Karen Fann says she can’t recall how she found the firm, but her critics believe one credential stood out: Cyber Ninjas’ chief executive officer had tweeted support for conspiracy theories claiming Republican Donald Trump, and not Democrat Joe Biden, had won Maricopa County and Arizona.\nNow the untested, little-known cyber security firm is running a partly taxpayer-funded process that election experts describe as so deeply flawed it veers into the surreal. Its chief aim, critics say, appears to be testing far-fetched theories, rather than simply recounting votes — an approach that directly undermines the country’s democratic traditions.", "url": "https://www.watoday.com.au/world/north-america/conspiracy-fuelled-firm-still-counting-arizona-votes-for-trump-20210524-p57ugr.html", "date_published": "2021-05-23 20:00:32"}
{"doc_key": "Hundreds participate in walk-in COVID-19 vaccine clinic for Latino community in OKC", "sentences": "Hide Transcript Show Transcript\nTO YOU. HEY GOOD EVENING TO YOU. YEAH FOR THE PAST FEW MONTHS. I WOULD NETU IN TO SOME OF THE VIRTUAL MEETINGS THE HEALTH PDEPARTMENT WOULD HAVE AND THEY ALWAYS TALKED ABOUT THEY WERE TRYING TO FIND WAYS TO REACH OUT TO SOME OF THESE .ENTITIES WHERE TYHE WERE SEEING THE VACCINATION NUMBERS WERE A LITTLE LOWER. SO TODAY THAT WAS ONE OF THEIR EFFORTS THAT WE SAW THEY ACTUALLY BROUGHT LIKE YOU SAID A WALK-IN NEIGHBORHOOD CLINIC WHERE PEOPLE COULD JUST WALK IN RIGHT THERE IN THEIR NEIGHBORHOOD. PEOPLE HAD BEEN ASKING US TO DO MORE OUTREACH TO LATINO COMMUNITY ALFREDO. MILLEDGE THE VACCINE IT IS IN THE LOCAL COMMUNITY, YOUNO KW PEOPLE AREN’T HINAVG TO SORT OF NAVIGATE AND PLAN AND DO ALL THE LOGISTICS INSTANT AND DRIVE TO THEY HOSTED IT AT A LOCAL CHURCH THAT PUSH TO HAVE IT IN THE UNITY IS REALLY JUST TO MAKE IT AS EASY AS POSSIBLE FOR ANYONEHO W WOULD LIKE TO GET VACCINATED. AN OPPORTUNITY TO VACCINATE UP TO 1000 PEOPLE ALFREDO SAYS THEY PLAN TOAVE H MORE OF THE WALK-IN CLINICS THROUGHOUT OKLAHOMA CITY IN THE FUTURE WITH THE HOPE, YOU KNOW OF GETTING PEOPLEN I PLACES WHERE THEY FEEL MORE COMFORTABLE. NOW AGAIN, IF YOU HAVENY A QUESTIONS, YOU CAN ALWAYS CALL THE COUNTY HEALTH DEPARTMENT OR OKLAHOMA CITY COUNTY HEALTH DEPARTMENTO T GET SOME MORE INFORMATION IF YOU JUST HAVE ANY QUESTIONS AND AGAIN, THEY’RE EN COURAGING EVERYONE AGES 12 AND UP TO GO AHEAD AND GET A VACCINE IF YOU WOULD LIKE ONE. REPORTING L\nAdvertisement Hundreds participate in walk-in COVID-19 vaccine clinic for Latino community in OKC Share Shares Copy Link Copy\nThe Oklahoma City-County Health Department hosted a walk-in COVID-19 vaccine clinic for the Latino and Hispanic communities.Throughout the past few months, the local health department has worked on ways to reach out to certain communities where it felt like the numbers for vaccinated people were low. So, on Saturday, the Oklahoma City-County Health Department hosted a neighborhood clinic that allowed people to walk in and get the vaccine.\"People have been asking us to do more outreach to the Latino community,\" said Alfredo Melchor, with the Oklahoma City-County Health Department.Melchor told KOCO 5 that the health department's goal is to make sure all communities have access to the COVID-19 vaccine.\"It is in the local community where people aren't having to navigate, to plan and do all the logistics,\" Melchor said.Instead of having a clinic at a health facility where people have to make an appointment and drive to, the health department hosted an event at the Templo de Alabanza Church on Southwest 25th Street in Oklahoma City.\"That push to have it in the community is just to make it easy as possible for anyone to get vaccinated,\" Melchor said.Hundreds of people took advantage of the vaccination event.\"We have an opportunity to vaccinate up to 1,000 people,\" Melchor said.The Oklahoma City-County Health Department plans to have more walk-in clinics throughout the city in the future.\"With the hope of getting people in places where they feel more comfortable,\" Melchor said.", "url": "https://www.koco.com/article/hundreds-participate-in-walk-in-covid-19-vaccine-clinic-for-latino-community-in-okc/36511371", "date_published": "2021-05-23 16:59:00"}
{"doc_key": "Kuwait: Man accused of conning women with marriage proposals", "sentences": "Dear Reader,\nThis section is about Living in UAE and essential information you cannot live without.\nRegister to read and get full access to gulfnews.com", "url": "https://gulfnews.com/world/gulf/kuwait/kuwait-man-accused-of-conning-women-with-marriage-proposals-1.1621802605962", "date_published": "2021-05-24 00:40:06"}
{"doc_key": "Activists call for fresh probe into killings of Turkish journalists", "sentences": "Activists call for fresh probe into killings of Turkish journalists\nJournalismPakistan.com May 23, 2021 Published 3 days ago\nISTANBUL—Media rights groups on Sunday urged Turkish authorities to investigate explosive allegations by a mafia boss about the high-profile killings of two journalists in the 1990s.\nSedat Peker, an underworld mobster exiled abroad, has accused members of the government and the ruling AKP party of corruption and various crimes in a series of YouTube posts over the past three weeks.\nIn the latest, released on Sunday, he alleges former interior minister Mehmet Agar was the head of the \"deep state\" in Turkey—and alleges Agar was involved in the 1993 murder of prominent investigative journalist Ugur Mumcu (pictured).\nMumcu, who wrote for the Cumhuriyet daily, was killed in the capital Ankara after somebody rigged his car to explode when he switched on the ignition. The perpetrators were never identified.\nIn his video recording, Peker described Mumcu as a \"martyr\" and a \"honourable man.\"\nThe mafia boss also claimed the murder of Turkish Cypriot journalist Kutlu Adali had been ordered by a former lieutenant colonel and a senior official of the National Intelligence Organization (MIT), Korkut Eken.\nAdali, who worked for the left-wing Yeni Duzen newspaper in Nicosia, was shot dead in front of his home in 1996. His killers have never been identified.\nErol Onderoglu, Turkey representative for Reporters Without Borders (RSF), said Peker's allegations needed to be investigated.\nThe truth about the killings of journalists in the 1990s had been \"swept under the rug\", he tweeted. \"Peker's legitimacy or position does not justify silence. #Impunity,\" he added.\nThe Turkish Journalists' Union called for answers Sunday. \"We want an investigation into the #UgurMumcu and #KutluAdali murders,\" the union tweeted. \"We demand that the suspects be put on trial. We call on prosecutors to do their duty.\"\nPeker, 50, who has been jailed several times for a range of offences, from fraud to running a criminal group, fled Turkey in 2020 to avoid prosecution and is thought to be currently living in the United Arab Emirates.\nSince then, he has released a spate of videos in which he claims to expose state-media-mafia links after police operations against him and his associates across the country in April.\nIn one, he accuses Interior Minister Suleyman Soylu of having offered him protection and of having tipped him off about an impending investigation against him last year, which allowed him to flee before being arrested.\nSoylu is one of the most powerful figures in President Recep Tayyip Erdogan's government. Despite pressure from the opposition to resign, he has dismissed Peker's allegations.\nA journalist for Turkey's state news agency Anadolu was fired Friday after raising Peker's claims against the interior minister at a government press conference with other ministers.\nFahrettin Altun, the Turkish presidency's director of communications, wrote on Twitter: \"Those who seek to harm the respectability of our state will pay the price.\"\nThere was no immediate reaction to the latest claims.\nSome commentators refer to what they call the workings of the \"deep state\"—derin devlet in Turkish—to talk about a shadowy structure alleged to exist with links between politicians, secret services, mafia and extremist groups. —AFP", "url": "http://www.journalismpakistan.com/activists-call-for-fresh-probe-into-killings-of-turkish-journalists", "date_published": "None"}
{"doc_key": "Moderna refuses to send vaccines to Punjab, says it only deals with central govt", "sentences": "CHANDIGARH, May 23: US-based COVID-19 vaccine manufacturer Moderna has refused to send vaccines directly to the Punjab government stating that it only deals with the Centre, a senior state official said on Sunday.\nPunjab’s nodal officer for vaccination Vikas Garg said according to Chief Minister Amarinder Singh’s directions, all vaccine manufacturers were approached for direct purchase of Covid vaccines including Sputnik V, Pfizer, Moderna, and Johnson & Johnson.\nA reply was received only from Moderna wherein the company refused to deal with the state government, he said.\nAccording to Moderna’s policy, it deals with the government of India and not with any state government or private parties, the Punjab government said in a statement.\nEarlier, CM Singh had directed officials to explore possibilities of floating a global tender for the procurement of vaccines from all possible sources to ensure that people of the state are vaccinated against COVID-19 at the earliest.\nNotably, Punjab was forced to stop vaccination for phase 1 and phase 2 categories because of the non-availability of vaccine doses.\nAll efforts would be made for the procurement of vaccines to meet the acute shortage in the state, which had received fewer than 44 lakh vaccine doses so far from the government of India, the statement said.\nFrom the government of India’s allocation for phase 3 (18-44 age group), the state government has been able to buy only 4.2 lakh vaccine doses, including 66,000 received on Saturday, Garg said.\nA total of 3.65 lakh have already been used and only 64,000 are left, he said. (PTI)", "url": "https://www.dailyexcelsior.com/moderna-refuses-to-send-vaccines-to-punjab-says-it-only-deals-with-central-govt/", "date_published": "2021-05-23 19:20:46"}
{"doc_key": "Twentysomething Man Shot, Killed in SoMa Saturday Night", "sentences": "A little after 11 p.m. Saturday, San Francisco police responded to a reported shooting at Mission Street between 7th and 8th streets; a man believed to be in his mid-twenties was found in his vehicle, suffering from an apparent gunshot wound.\nAs reported by ABC7, a late-night shooting yesterday left a twentysomething dead inside his car in SoMa. When officers first arrived on the scene, they discovered a man in his mid-20s dying from a gunshot wound.\nAccording to police, the man died a short time later after being found at 11:15 p.m. Saturday. San Francisco police are now investigating the killing as a homicide; no additional information — including the victim's name — is available at this time.\nThis shooting comes just a week after two separate spats of gun violence killed two men in Potrero Hill.\nAnyone with information related to this killing is urged to call 415-575-4444, and tips can be left anonymous or not.\nRelated: Two Killed in Separate Saturday Shootings in Potrero Hill", "url": "https://sfist.com/2021/05/23/twentysomething-man-shot-killed-in-soma-saturday-night/", "date_published": "2021-05-23 20:26:46"}
{"doc_key": "Shootout leaves 1 person dead, police officer injured", "sentences": "RED BUD, Ill. (AP) — A shootout early Sunday left one person dead and a police officer injured in southwestern Illinois, according to Illinois State Police.\nRed Bud police responded to a call of gunfire around 1:40 a.m. Sunday. Police allege a male suspect shot at a police officer. A second officer then fired at the male, killing him, according to Illinois State Police. The agency was investigating.\nThe injured police officer was shot in the calf and was released from the hospital.\nPolice did not release further details.\nRandolph County State’s Attorney Jeremy Walker said the deceased male is not an Illinois resident and further details would come at a Monday news conference.\nRed Bud is roughly 35 miles from St. Louis.", "url": "https://www.sfgate.com/news/article/Shootout-leaves-1-person-dead-police-officer-16197731.php", "date_published": "2021-05-23 20:26:50"}
{"doc_key": "Don’t Mention the Uighurs", "sentences": "Nothing enrages the mullahs in Tehran more than the existence of the world’s only Jewish state, especially when the Palestinian conflict is roiling. So, as the IAF responded to 4,000 Hamas missiles raining down on Israeli civilians over the last 11 days, Iran has been cranking up the vitriol to eleven. Never mind that Hamas rockets don’t discriminate between Jew or Muslim, or that Israel narrowly targets terrorists and their infrastructure. It is always politic for Iran to frame these issue in religious terms and themes. After all, Ayatollah Khamenei professes to be “Guardian Commander of Muslims,” a fierce champion for all Muslims worldwide.\nExcept he is nothing of the sort: not for Muslims in Syria, in Russia, and least of all in China.\nUntil recently, the regime has maintained a tactful hush while the Chinese Communists have been systematically torturing, raping and otherwise ‘re-educating’ up to one million Uighur Muslims in secret internment camps since at least 2017 as part of its “people’s war on terror.”\nThe ‘hush’ was punctuated in 2019 when Iran signed on to a letter addressed to the President of the Human Rights Council (HRC) at the United Nations. Astonishingly, the letter did not censure China. Indeed, it was a letter of commendation in favor of China’s brutalization: “Faced with the grave challenge of terrorism and extremism,” it contended, “China has undertaken a series of counter-terrorism and deradicalization measures in Xinjian, including setting up vocational education and training centers… We note with appreciation that human rights are respected and protected in China in the process of counter-terrorism and deradicalization.”\nIran’s part in that shameless endorsement was dissipated by the fact that 49 other countries likewise signed on, but clearly it was a sign of things to come.\nNow, with the signing of the ‘Strategic Partnership’ agreement between Presidents Xi and Rouhani in January this year, Iran’s complicity in this true 21st century anti-Muslim atrocity has become explicit and official government policy – at least for the next quarter-century.\nThe agreement affirms both countries’ commitment to the ‘principle’ of “non-interference in the internal affairs of countries,” while recognizing “terrorism, extremism and separatism as threats against all humanity and the global peace and stability.” In other words, China demands not only that Iran “don’t mention the Uighurs” – but also accept that Beijing has the right and indeed the responsibility to round up and brutalize Turkic Muslims, all for the advancement of “global peace.”\nAnd in return for Tehran’s acquiescence, China pledges to keep buying Iranian oil while likewise overlooking all the horrific human rights abuses that Iran perpetrates on its own ethnic and religious minorities, LGBTQ people and anti-regime journalists and dissidents.\nOf course it is no great surprise that the Iranian regime turns a blind eye to outrageous acts of persecution.\nThe only things Khamenei, the great Champion of Muslims, has managed to successfully “champion” in his 32 years in the top job are domestic cruelty, overseas terrorism and a bourgeoning nuclear weapons program. In this domain, his and the regime’s rancor are nakedly opportunistic – reserved exclusively for Israel and the United States – and Iran’s collusion with China clearly belies any genuine solidarity with oppressed co-religionists in other countries. It is unfortunate nonetheless that many otherwise rational people across the West also echo Iran’s false, divisive rhetoric and hypocritical stance.", "url": "https://blogs.timesofisrael.com/dont-mention-the-uighurs/", "date_published": "2021-05-23 22:55:00"}
{"doc_key": "Education notebook: A look ahead to Abilene graduations", "sentences": "CLOSE\nWith high school graduations across much of the Big Country this week, here's a bit of a glance at what we have planned for coverage on our end.\nMonday's edition kicks off our week-long coverage with a feature story on Wylie High School senior Brooklyn Eastman.\nEastman's story of overcoming adversity and finding the rays of sunshine in life despite her diagnosis with Tourette syndrome at 10 years old is a perfect way to kick off the week.\nFollowing Eastman's story on Tuesday will be a feature on Bryant Scarlett, a 21-year-old student who's graduating, finally, from Premier High School.\nScarlett was born and raised in Jamaica and never considered school a priority. Then, he, his mother and his sister took a bus ride to Abilene and he discovered in himself a drive to turn his life around.\nWednesday will feature Abel Rodriguez, a graduating Academy of Technology, Engineering, Math and Science senior who, despite family drama, is poised to follow in his brother's footsteps and join the Navy.\nHe'll focus on nuclear engineering once he completes boot camp, which begins at the end of June.\nCome Thursday, readers can enjoy the annual front page featuring the faces of the Big Country's valedictorians and salutatorians of the Class of 2021.\nEditor Greg Jaklewicz will feature Hannah Hillis, who has theater and writing skills, among others, of Abilene High in his weekly column\nFriday will then feature Cooper High graduate Madi Abhor, while Saturday's focus will be on Abilene High student Emily Shelburne.\nAnd as a reminder, graduation ceremonies in Abilene this week are set for:\n► Premier High, 7 p.m. Thursday at the Paramount Theatre, 352 Cypress St.;\n► ATEMS, 8:30 a.m. Friday at Shotwell Stadium, 1525 E. S. 11th St.;\n► Wylie High, 7 p.m. Friday at Taylor County Expo Center, 1700 TX-36;\n► Cooper High, 8 p.m. Friday at Shotwell Stadium, 1525 E. S. 11th St.;\n► Abilene High, 8 p.m. Saturday at Shotwell Stadium, 1525 E. S. 11th St.\nBuy Photo Education Reporter Timothy Chipp (Photo: Reporter-News file photo)\nAs outdoor events, the Abilene ISD does have the ability to reschedule graduation in the event of rain. Superintendent David Young said any rain event would push the ceremonies back a day if need be.\nATEMS could move to Saturday morning, while CHS or AHS ceremonies could be moved to Sunday at the same time if weather prohibits a safe and fun experience.\nAnd those attending graduation will not be required to wear masks, the district confirmed. The decision was made before Gov. Greg Abbott's executive order this past week prohibiting schools and other governmental entities from requiring face coverings beginning in June.\nHowever, the district also decided students and teachers will be required to wear masks or other facial coverings throughout the final week of school.\nAdult education graduation, too\nAnother graduation this week is less heralded, but just as important. Abilene ISD's adult education program students are crossing a stage at 10 a.m. Tuesday at the Alta Vista campus, 1929 S. 11th St.\nMignon Lawson, program director of the past nine years and in education for 26 years, is retiring and was the focus of a column by Jaklewicz.\nMore: Birds and the spelling bees: Retiring Mignon Lawson taught sex ed, led adult ed program\nThe students elected to hold their graduation ceremony at the campus, rather than at one of the stages at a district high school (the normal venue) due to COVID-19 concerns that linger on, according to Young.\nCongratulations to all of this year's graduates, be they young or young at heart.\nTimothy Chipp covers education and is general assignments reporter for the Abilene Reporter-News. If you appreciate locally driven news, you can support local journalists with a digital subscription to ReporterNews.com.\nRead or Share this story: https://www.reporternews.com/story/news/columnists/tim-chipp/2021/05/23/education-notebook-look-ahead-abilene-graduations/5221224001/", "url": "https://www.reporternews.com/story/news/columnists/tim-chipp/2021/05/23/education-notebook-look-ahead-abilene-graduations/5221224001/", "date_published": "2021-05-23 20:00:03"}
{"doc_key": "Dixon fastest by a fraction", "sentences": "Scott Dixon has claimed pole position for the 105th running of the Indianapolis 500.\nPhoto: Icon Sportswire 2021\nThe reigning IndyCar champion has clocked the fastest four lap average speed in the final fast nine shoot-out at Indianapolis Motor Speedway.\nHe recorded an average speed of 231.685mph, just three one hundredths of a mile quicker than American Colton Herta.\n\"Towards the end of that (last) lap there it got pretty sketchy and we scrubbed a ton of speed but three one hundredths (of a mile). It doesn't matter what it is we'll take that,\" Dixon said.\n\"I could see they making some adjustments to the car before I rolled out. Nobody told me anything. I told (engineer Michael) Cannon I didn't want to hear about it.\n\"It was pretty loose. The last lap I was hoping that I was going to make it through turn three. I turned in a little too early.\"\nIt is the fourth time Dixon, 40, has claimed pole position in his decorated IndyCar career.\nHe won from pole in 2008, but was fourth in 2015 and 32nd in 2017.\nPhoto: Icon Sportswire\n\"It's been a little while since I had a pole so it's nice to get it here.\"\nIt's the fourth time he has qualified fastest for the Indy 500.\nDixon had to settle for second place last year and feels he has unfinished business at Indianapolis Motor Speedway.\n\"Always but you know this place owes me nothing.\n\"I'm very privileged and very lucky to come here and race and to come with the team I do it with.\n\"We lost as a team last year and we're all very hungry and we have four great cars with Chip's team.\n\"We're going to obviously take the PNC Bank car to the lead but if it's not me I hope it's one of my three team-mates.\"\nScott Dixon's Chip Ganassi Racing team-mates Tony Kanaan, Alex Palou and Marcus Ericsson will start from fifth, sixth and ninth respectively.\nFellow New Zealander Scott McLaughlin will start from 17th in his Indy 500 debut.", "url": "https://www.rnz.co.nz/news/sport/443219/dixon-fastest-by-three-one-hundredths", "date_published": "2021-05-24 10:03:06"}
{"doc_key": "Journalist arrested after Belarus military forces Ryanair flight to land", "sentences": "A Ryanair jet landed in Lithuania after the Belarusian military forced it earlier on Sunday to divert to Minsk, where authorities arrested a journalist who covered protests against President Alexander Lukashenko.\nThe Boeing Co. 737-800 carrying scores of passengers from Athens to Vilnius was diverted to the Belarusian capital under the escort of a Mig-29 fighter jet after its crew was notified by authorities in Minsk of a “potential security threat on board,” a Ryanair spokeswoman said.\nAuthorities boarded the plane and arrested Raman Pratasevich, the former editor-in-chief of one the most popular Telegram news channels in Belarus. Pratasevich wasn’t on the plane when it took off again, Lithuanian President Gitanas Nauseda said in a recorded statement.\nAn adviser to Belarusian opposition leader Sviatlana Tsikhanouskaya said Pratasevich, 26, had been bundled off the flight in Minsk by police. “At first he panicked, then calmed down a bit, but still was trembling. He said he’ll face the death penalty here. He was taken aside, his belongings dumped on the runway,” Franak Viacorka said on Twitter, citing passengers.", "url": "https://nationalpost.com/news/journalist-arrested-after-belarus-military-forces-ryanair-flight-to-land", "date_published": "2021-05-23 20:29:00"}
{"doc_key": "Fourteen people, including at least one child, have died in Italy after a cable car plunged 20 metres to the ground", "sentences": "At least 14 people have died and a child was seriously injured when a cable car linking Italy's Lake Maggiore with a nearby mountain plunged 20 metres to the ground.\nThe Stresa-Mottarone cable car takes tourists and locals from the town on Lake Maggiore, almost 1,400 metres above sea level to the top of the Mottarone mountain in 20 minutes.\n\"We are devastated, in pain,\" Marcella Severino, Stresa's mayor told broadcaster RAI, while Italian Prime Minister Mario Draghi voiced his condolences to the families of the victims.\nEPA/TINO ROMANO\nThe cable car was travelling up the mountain when the cabin fell some 20 metres to the ground and rolled several times down the steep slopes before it was stopped by trees, Mr Severino said.\nPeople hiking nearby heard a loud hiss just before the crash, she said, adding that the accident was believed to have been caused by one of the cables breaking.\nItaly's alpine rescue service said a call had first come just after midday, adding that the cable car was lying \"crumpled\" in the woods and two children were taken by helicopter to a paediatric hospital in the nearby city of Turin.\nMs Severino said that some of the victims had been found trapped inside the car, with others thrown out into the woods.\n\"It is a terrible moment for me and for our community and I think also for the whole of Italy.”\nMarcella Severino, Mayor of Stresa, after a deadly cable car accident that killed at least 14 people pic.twitter.com/angFSTSS4V — TRT World Now (@TRTWorldNow) May 23, 2021\nCoroners had started identifying the victims, who included foreign nationals, she said, without giving further details.\nThe eldest of the two children taken to hospital, who was believed to be between nine and 10, died after suffering two cardiac arrests, the hospital said.\nDirector-General Giovanni La Valle said the hospital did not have personal data for the two children and that nobody had been in contact with the hospital for them, indicating that other family members could have been involved in the accident.\nThe youngest child, estimated to be five years old, was conscious upon his arrival at the hospital and spoke Italian. He was undergoing surgery to stabilise multiple fractures.\nMr La Valle said another person, who was previously thought to have been injured, had not in fact been taken to hospital.\nEPA/ITALIAN FIRE AND RESCUE SERVICE\nThe Stresa-Mottarone lift had only recently re-opened following the gradual lifting of coronavirus restrictions.\n\"It's a terrible moment for me and for our community and I think also for the whole of Italy. Especially now that we were just beginning to restart (after the pandemic),\" Ms Severino said.\nThe Mottarone peak is popular among tourists because of its panoramic views on Lake Maggiore and its picturesque islands as well as the vista of the surrounding Alps.\nThe cable car service first opened in August 1970 after almost three years of works to replace a cog railway, its website said.\nPhoto by Marco BULGARELLI/Gamma-Rapho via Getty Images\nThe dual cable system is split into two sections, just over two kilometres between Stresa and Alpino and another three kilometres between Alpino and Mottarone. It consists of two cars, in alternate directions, with each one carrying up to 40 passengers, it added.\nMs Severino said that important maintenance works, including changing the cables, had been carried out in recent years.\n\"All of this is hard to believe,\" the mayor said.", "url": "https://www.sbs.com.au/news/fourteen-people-killed-as-italian-mountain-cable-car-plunges-20-metres-to-the-ground", "date_published": "2021-05-24 06:03:05"}
{"doc_key": "Will deal only with Centre: Pfizer, Moderna", "sentences": "CHANDIGARH/NEW DELHI: Global drug majors are preferring to deal directly with the Centre instead of engaging with states and private entities to supply Covid-19 vaccines even as supplies of shots worldwide remain scarce and are the main issue of discussion.\nMassachusetts-based biotechnology company Moderna, which has developed a messenger RNA (mRNA) vaccine to tackle Covid-19, has declined the Punjab government’s request for direct supply of its vaccine to the state. The US firm said as per its policy, the company only deals with central governments. Government sources, however, also said Moderna made it clear that it really did not have extra supplies till the year-end.\nCentral government sources said in the case of Pfizer, the discussions around the indemnity clause that the company wants to be exempted had progressed well and the issue of supplies had to be sorted out for the vaccines to be delivered to India. The mRNA vaccine is authorised for use in almost 50 nations, including the US, EU, UK, Canada, Singapore and South Korea.\nEarlier, Pfizer had also said it wanted to deal with the Centre. The company has been in talks with the government to enter India and has sought certain exemptions and safeguards. It has followed a similar model across most countries.\nBesides, most companies are facing capacity constraints given the massive demand for vaccines around the globe.\nPfizer and BioNTech are looking to ramp up production to 2.5 billion doses by the end of the year. Moderna, for instance, is hoping to make 800 million to a billion shots this year, with its manufacturing capacity projected to touch 3 billion doses in 2022.\nPunjab nodal officer for vaccination Vikas Garg said all vaccine manufacturers were approached by the state government for direct purchase, including Russia’s Sputnik V, Pfizer-BioNTech, Moderna and Johnson and Johnson’s Janssen, as directed by chief minister Amarinder Singh. Garg said Punjab had received a reply only from Moderna, which refused to deal with the state government.\nThe Punjab government was forced to stop vaccination for Phase-I and II categories in the last three days because of non-availability of Covid-19 vaccines. The officer said the Punjab government was making all efforts for procurement of vaccines to meet the acute shortage in the state, which had received fewer than 44 lakh doses from the central government so far.", "url": "https://www.msn.com/en-in/news/other/will-deal-only-with-centre-pfizer-moderna/ar-AAKiSyJ", "date_published": "2021-05-23 20:40:29"}
{"doc_key": "it’s time to start listening...", "sentences": "(Photo: Guillem Sartorio / Bloomberg via Getty Images)\nMigration from Africa to the EU is the result of more than poverty, conflict and desperation. It is also due to the desire for a better life. Many educated Africans ‘on the move’ are already employed and earning in their home countries and migrate to seek opportunities for improved livelihoods.\nDr Chenai Matshaka-Munyaka is a senior researcher at the University of Johannesburg’s Institute for Pan-African Thought and Conversation.\nSince the so-called “European migrant crisis” in 2015, in which the EU Commission’s Eurostat records that about 1.3 million people applied for asylum in the EU and other European states, the irregular movement of Africans into the EU has continued to be viewed as such — a crisis.\nThis is despite the findings of the UN High Commissioner for Refugees that the largest number of migrants arriving on European shores during this period originated mainly from Syria (46.7%), Afghanistan (20.9%) and Iraq (9.4%).\nAfrican migrants’ experiences of racism, discrimination and the denial of basic human rights, including food and shelter on their arrival in Europe, are seldom told. Also missing from these chronicles and policy debates are the resilience of the migrants in navigating restrictive asylum systems, working mainly in the informal sector, contributing to the development of EU economies in diverse ways, and giving back to the continent of their birth through remittances. These experiences of African migrants are perpetually relegated to the back burner, resulting in fragmented policy responses on migration.\nStories of the drowning or rescuing of the “boat migrants” from Africa have dominated the discussion on Africa-EU migration governance, eliminating the nuances of this movement. In 2020, the International Organization for Migration reported 33,418 new arrivals from Africa on European shores and 983 deaths. With so many African migrants risking their lives in harrowing journeys to Europe, it has become imperative for both African and European policymakers to rethink migration governance to save lives, protect migrants on arrival in Europe and expand the opportunities for legal pathways to Europe. This requires moving beyond simplistic analyses, which focus on conflict and poverty as “root causes” of migration.\nThe University of Johannesburg’s Institute for Pan-African Thought and Conversation in South Africa and the Sweden-based Nordic Africa Institute recently hosted a virtual policy dialogue titled “Centering the Voices of African Migrants in Africa-European Union Migration Debates”. The meeting sought to provide a platform for African and EU policymakers and African migrants to converge on issues of migration between the two continents in accordance with the 2018 UN Global Compact for Safe, Regular and Orderly Migration.\nFifty-one participants, including experts on migration from Africa, Europe and beyond participated in this dialogue. Joseph Peters, a migrant from Sierra Leone affiliated to the Joel Nafuma Refugee Centre in Italy, and Dr Joy Kategekwa, the strategic adviser to the regional director of the UN Development Programme’s Regional Bureau for Africa in New York, were the main speakers.\nLeaving behind a beloved home country, insecurity in a neighbouring country, being enslaved by armed groups in Libya, and finally making it to hostile European shores — stories of irregular African migration, which feature less in policy discussions on Africa-EU migration, were shared during the webinar.\nA key question arising from the policy dialogue was how policymakers on both continents understand migration as well as their commitments to policy shifts in migration governance. While EU policymakers have focused on curbing irregular African migration, African leaders have identified the developmental benefits to the continent. Indeed, EU countries have taken a “carrot and stick” approach to Africa-EU migration, as seen by the huge financial commitment of its member states to keep Africans in Africa.\nThe EU Commission proposed in its 2021–27 budget cycle, spending €34.9-billion (R593.5-billion) on border security to manage migration. In addition to security measures, the EU has sought to use development aid to curb migration. The EU Emergency Trust Fund for Africa has been one of the key responses and by May 2020, it had funded 225 programmes in 26 countries across the Sahel and Lake Chad region, the Horn of Africa and North Africa.\nHowever, as revealed during discussions at the policy dialogue, Africa-EU migration is the result of more than poverty, conflict and desperation. It is also due to the desire for a better life and to fulfil aspirations that are not easily accessible or available in Africa. As noted during the policy dialogue, many educated Africans “on the move” are already employed and earning in their home countries and migrate to seek opportunities for improved livelihoods.\nFor African governments, migration is a tool for development on the continent and viewed from this lens, benefits countries of origin, transit and destination. This was highlighted in the UN Development Programme’s 2019 report, “Scaling Fences”, which captured the viewpoints of about 1,000 African migrants selected from 39 African countries in 13 EU member states — and further discussed at the policy dialogue. The employment of irregular African migrants in agriculture, factories and other sectors in EU countries points to a vibrant market for African labour.\nThe remittances sent back by migrants to their home countries are crucial for sustaining livelihoods and enhancing development, with the World Bank reporting remittances of $42-billion to sub-Saharan Africa in 2020. Therein lies the importance of finding the right approaches to migration governance, protecting migrants in the EU, and creating more opportunities for regular channels of migration.\nAmong the key recommendations that emerged from the policy dialogue was for policymakers from Africa and the EU to shift their perspectives on migration to more holistic and sustainable solutions. African governments must embark on creating policies that further human development and expand opportunities for citizens across all sectors. In a similar vein, EU states must shift their focus from the prevention of migration to regularising it through more inclusive migration governance, which recognises the contribution of African migrants to EU economies.\nWe need inclusive migration policies which recognise the plight of irregular African migrants, have the potential to create sustainable benefits for both Africa and the EU and prevent the loss of lives on perilous journeys across the Mediterranean Sea and the Sahara Desert. DM\nChenai Matshaka-Munyaka Follow Save More", "url": "https://www.dailymaverick.co.za/article/2021-05-23-migration-to-europe-its-time-to-start-listening-to-african-voices-african-stories/", "date_published": "2021-05-23 20:01:16"}
{"doc_key": "Liz Cheney Calls Marjorie Taylor Greene’s Mask Rant ‘Evil Lunacy’, Forcing Us to Once Again Agree With Liz Cheney", "sentences": "Maskless clowns to the left of me, conspiracy jokers to the right, here I am, stuck in the middle with Liz Cheney. Rep. Liz Cheney (R-Wyo.) spoke out on Twitter against Georgia Rep. Marjorie Taylor Greene’s latest offensive and unhinged rant. In an appearance on Christian Broadcasting Network host David Brody’s podcast “The Water Cooler”, Greene compared the House’s mask mandate to the Holocaust, saying, “You know, we can look back at a time in history where people were told to wear a gold star, and they were definitely treated like second-class citizens so much so that they were put in trains and taken to gas chambers in Nazi Germany, … And this is exactly the type of abuse that Nancy Pelosi is talking about,” she added.\n© Provided by The Mary Sue US Representative Liz Cheney speaks to press at US Capitol.\nMTG says Speaker Pelosi wanting Members of Congress to get vaccinated and if not to wear masks is “exactly the type of abuse” as murdering Jews in gas chambers during the Holocaust and David Brody nods along. No follow up. pic.twitter.com/inXfD8UBiG — Jake Tapper (@jaketapper) May 22, 2021\nBecause having to wear a piece of cloth on your face to protect co-workers from a deadly virus is absolutely the same as the genocide of the Jewish people. Very cool and normal perspective on the Holocaust! And while journalists and democrats called out MTG’s deranged anti-Semitic rant, republicans stayed unsurprisingly silent. With the exception of course, of the last sane person left in the republican party, Liz Cheney. Cheney tweeted “This is evil lunacy.” in response to the video.\nThis is evil lunacy. https://t.co/xHeUgbx7wa — Liz Cheney (@Liz_Cheney) May 22, 2021\nCheney’s was joined by a handful of republicans in condemning Greene, including Rep. Adam Kinzinger (R-IL) and Rep. Peter Meijer (R-MI), who told host Dana Bash on CNN’s State of the Union, “Any comparisons to the Holocaust, it’s beyond reprehensible. This is, I don’t even have words to describe how disappointing it is to see this hyperbolic speech that frankly amps up and plays into a lot of the antisemitism that we’ve been seeing in our society today, vicious attacks on the streets of New York and in Los Angeles that should be, and I do condemn that in the strongest terms. There’s no excuse for that.”\nComparing wearing masks to the abuse of the Holocaust is a not so subtle diminution of the horrors experienced by millions. It’s a grotesque idiocy mixed with a neurotic lack of self awareness. What do you expect from a truther, Q believer, and gaslighting conspiracy theorist? https://t.co/tkH1vIOAfb — Denver Riggleman (@RepRiggleman) May 22, 2021\nCheney was recently ousted as GOP conference chair, largely due to her criticism of Donald Trump and her refusal to join in on the republicans’ Big Lie over Trump losing the election. Cheney, Kinzinger, Meijer, and others form the small contingency of republicans placing democracy over QAnon conspiracy theories.\nLoad Error\nIs Cheney right about Greene? Absolutely. But before we go lauding her as some sort of feminist folk hero, let’s remember that this is the same woman who voted with Trump 93 percent of the time. Cheney also sold out her gay sister in opposing marriage equality in a failed bid for the Wyoming senate seat. She has aided and abetted Trump’s cruel and corrupt agenda from the start, and has worked as a faithful steward of republican politics.\nIn true Serena Joy fashion, Cheney has finally realized that she’s the architect of her own political demise. But the poetic justice of Cheney getting owned is diminished by the frightening policies and tactics of the majority of the republican party.\n(via HuffPost, image: Mandel Ngan/AFP via Getty)\nWant more stories like this? Become a subscriber and support the site!\n—The Mary Sue has a strict comment policy that forbids, but is not limited to, personal insults toward anyone, hate speech, and trolling.—\nContinue Reading Show full articles without \"Continue Reading\" button for {0} hours.\nThe post Liz Cheney Calls Marjorie Taylor Greene’s Mask Rant ‘Evil Lunacy’, Forcing Us to Once Again Agree With Liz Cheney first appeared on The Mary Sue", "url": "https://www.msn.com/en-us/news/politics/liz-cheney-calls-marjorie-taylor-greene-s-mask-rant-evil-lunacy-forcing-us-to-once-again-agree-with-liz-cheney/ar-AAKiEN3", "date_published": "2021-05-23 20:35:38"}
{"doc_key": "IATA calls for thorough probe into Ryanair plane incident in Minsk", "sentences": "GENEVA, May 23. /TASS/. The International Air Transport Association (IATA) has called for a thorough investigation of the incident with an Ryanair flight in Belarus.\n\"We strongly condemn any interference or requirement for landing of civil aviation operations that is inconsistent with the rules of international law. Details of the event with flight FR4978 are not clear. A full investigation by competent international authorities is needed,\" it wrote on its Twitter account.\nA Ryanair plane flying from Athens to Vilnius made an emergency landing at Minsk’s airport on Sunday after a reported bomb threat. The plane landed safely. No bomb was found inside.\nRoman Protasevich, a co-founder of the Nexta Telegram channel, which had been recognized as extremist in Belarus, was among the passengers. Protasevich, currently living in Lithuania, is wanted in Belarus. The man was detained after the plane’s landing in Minsk.\nThe plane took off from Minsk late on Sunday.", "url": "https://tass.com/world/1292893", "date_published": "None"}
{"doc_key": "US General: As US Scales Back in Mideast, China May Step In", "sentences": "Marine Gen. Frank McKenzie, top U.S. commander for the Middle East, speaks to reporters traveling with him in Riyadh, Saudi Arabia, on Sunday. (AP Photo/Lolita Baldor)\nRIYADH, Saudi Arabia (AP) — As the United States scales back its military presence across the Middle East to focus on great power competition with China and Russia, it risks giving those two countries a chance to fill the gap and expand their influence around the Gulf, the top U.S. commander for the region said Sunday.\nWhile traveling through the Middle East over the past week, Marine Gen. Frank McKenzie, who heads U.S. Central Command, fielded a persistent question from the military and political leaders he met: Is the U.S. still committed to their country and the region, and what more support can they get.\nFrom the dusty battlefields in Syria to the rocket-pummeled neighborhoods in Iraq and Saudi Arabia, they worry that America’s pivot to Asia means they will be left without the troops, ships, aircraft and other military aid they need to battle Iranian-backed militant groups attacking their people.\nAnd if the U.S. is slow to respond, they may look elsewhere for help.\n“The Middle East writ broadly is an area of intense competition between the great powers. And I think that as we adjust our posture in the region, Russia and China will be looking very closely to see if a vacuum opens that they can exploit,” McKenzie told reporters traveling with him. “I think they see the United States shifting posture to look at other parts of the world and they sense there may be an opportunity there.”\nSpeaking in his hotel room after meeting with Saudi officials, McKenzie said weapons sales would be one need that Moscow and Beijing could exploit. Russia, he said, tries to sell air defense systems and other weapons to whomever it can, and China has a long-term goal to expand its economic power and ultimately establish military bases in the region.\nIn the few short months since President Joe Biden took office, he has ordered the full withdrawal of U.S. troops from Afghanistan and begun to review America’s force presence in Iraq, Syria and around the globe. His administration is cutting U.S. military support for the Saudi-led offensive against Iranian-back Houthi rebels in Yemen, and the Pentagon has moved ships, forces and weapons systems out of other Middle East countries.\nAt the same time, however, Biden this month dispatched senior administration officials to the Gulf region to reassure nervous allies as the U.S. looks to reopen talks with Iran on the 2015 nuclear deal, which former President Donald Trump scrapped three years ago.\nThe effort to restart talks with Iran triggers worries in a number of Middle East nations who rely on the U.S. to maintain pressure on Tehran and its campaigns to fund and supply weapons to militant groups in the region.\nBut there is ongoing discussion within the Pentagon about sending more assets to the Pacific to fight a rising China. And U.S. military commanders around the globe, including McKenzie, may lose troops and resources as a result. Those could include warships such as the aircraft carrier now sitting in the Gulf, providing security for the Afghanistan withdrawal.\nThe Biden administration views China’s rapidly expanding economic influence and military might as America’s primary long-term security challenge. Officials believe the U.S. must be more ready to counter threats to Taiwan and China’s development of military outposts on manmade islands in the South China Sea.\nMilitary commanders caution that China’s growing assertiveness isn’t limited to Asia, noting that Beijing is aggressively seeking footholds in Africa, South America and the Middle East.\n“I agree completely that China needs to be the pacing threat we orient on,” McKenzie said in the interview with reporters from The Associated Press and ABC News. “At the same time, we are a global power and we need to have a global outlook. And that means that you have the ability to consider the globe as a whole.”\nIn meetings Sunday, Saudi leaders were “very concerned” about the ongoing U.S. military posture review, McKenzie said. The kingdom is under almost daily bombardment from Houthi rebels with a variety of ballistic missiles, cruise missiles and small drones. And Saudi leaders rely on the U.S. to help them defend themselves.\nMcKenzie said his message to them was that the number of troops and weapons is not as important as the overall capability of the integrated U.S. and Saudi air and missile defense system arrayed around the country.\nAnd more broadly, he said, that strategy of doing more in the region with less military presence may prevent China and Russia from cashing in on any U.S. void.\n“I’m not sure it’s actually going to turn out to be an opportunity for them when it’s all said and done,” he said.\nThe troop numbers may not be the same as the hundreds of thousands that were in the region five to seven years ago, he said, but the U.S. will have a presence in the region.\n“I think we’re going to play a very smart game… to leverage what we have,” he said. “The United States is the partner of choice. It’s only when that option is not open are countries going to hedge and seek other opportunities.”\nBy LOLITA C. BALDOR Associated Press", "url": "https://www.courthousenews.com/us-general-as-us-scales-back-in-mideast-china-may-step-in/", "date_published": "2021-05-23 19:20:51"}
{"doc_key": "San Francisco fact of the day", "sentences": "At a board of supervisors hearing last week, representatives from Walgreens said that thefts at its stores in San Francisco were four times the chain’s national average, and that it had closed 17 stores, largely because the scale of thefts had made business untenable.\nBrendan Dugan, the director of the retail crime division at CVS Health, called San Francisco “one of the epicenters of organized retail crime” and said employees were instructed not to pursue suspected thieves because encounters had become too dangerous.\n“We’ve had incidents where our security officers are assaulted on a pretty regular basis in San Francisco,” Dugan said.\nAnd yes incentives matter:\nThe retail executives and police officers emphasized the role of organized crime in the thefts. And they told the supervisors that\n[Published in NonProfitBlogs - Read the original article]", "url": "http://humanitariannews.org/20210523/san-francisco-fact-day", "date_published": "2021-05-23 00:00:00"}
{"doc_key": "Gunman opens fire at hundreds at house party", "sentences": "Hundreds of people were forced to flee a house party in New Jersey after a gunman stormed the home and opened fire.\nHundreds of people were forced to flee a house party in New Jersey after a gunman stormed the home and opened fire....\nHundreds of young people a house party in the US found themselves under fire and fleeing for their lives after a gunman stormed the home and began firing.\nAt least two people have been confirmed dead and a dozen have been injured at the house party in Cumberland County — quiet, rural community 80km south of Philadelphia — New Jersey State police said.\nPolice were called to the scene just before midnight Saturday, said they arrived to find the bodies of a 30-year-old man and a 25-year-old woman. One of the wounded partygoers was hospitalised in critical condition, police said in a statement.\nA relative of one of those at the party told local news there were horror scenes as the gunman opened fire.\n“My nephew said he was having a good time, next thing he heard was shooting and he was running for his life,” John Fuqua said.\n“He was on the ground. He had to crawl. He had to step over a dead body, a dead body that would be eventually be identified as a young man he grew up with.”\nJohn Fuqua said his nephew had to run for his life and step over a dead body during what police say was a mass shooting in rural Cumberland County, New Jersey. NBC10’s @RandyGyllenhaal has the latest details: https://t.co/3taz2qn2q3pic.twitter.com/syhxwEJ7q1 — NBC10 Philadelphia (@NBCPhiladelphia) May 23, 2021\nAcross the street from the house, the Rev. Michael Keene, of Trinity AME Church, said he initially thought fireworks were going off.\n“I just started hearing at first what I thought was fireworks, it was really gunshots, and I heard nine in rapid succession,” Keene told WPVI.\n“If you’re going to a party, why do you need to take a gun?” he asked. “If you’re there to have a good time why do you need a gun with you? That means you’re expecting trouble to me.”\nOn Sunday, police with search dogs were patrolling the perimeter of the large property and detectives swept the front lawn with metal detectors.\nThe gunman fled the scene and is still at large.\n“No arrests have been made, and the motive and incident remain under investigation,” police said.\nNew Jersey Gov. Phil Murphy called the shooting “despicable and cowardly”.\n“Since late last night, the New Jersey State Police and county and local law enforcement in Cumberland County have been investigating the horrific mass shooting at a large house party in Fairfield Township that attracted hundreds of partygoers,” Murphy said in a statement Sunday.\n“At this time, at least two people have lost their lives, among numerous other shooting victims, including several with injuries that are life-threatening. We hold those who have died, and their families, in our prayers today, and we also pray for the recoveries of those injured. We are grateful for the swift response of law enforcement and stand with them as they continue their investigation,” he said.\n“Let there be no mistake: This despicable and cowardly act of gun violence only steels our commitment to ensuring New Jersey leads the nation in passing and enforcing strong and commonsense gun safety laws. No community should ever experience what occurred last night in Fairfield.”\nThere have been 224 mass shootings in America this year so far, according to the Gun Violence Achive.", "url": "https://www.news.com.au/world/north-america/gunman-opens-fire-at-hundreds-at-house-party-in-new-jersey/news-story/282b541153e6ac3d1bf1327f15330aca", "date_published": "2021-05-23 20:08:00"}
{"doc_key": "Students look up to Wyoming high school ag program teacher", "sentences": "Stone has known Cress for decades, and has always been impressed with his drive and work ethic. When Cress made the switch back to teaching, Stone said Cress hit the ground running and has proven himself to be a solid role model for Wyoming’s future generation of farmers and ranchers.\n“He is an incredibly hard worker. He researches everything,” said Stone. “That spills over to the kids.”\nThat’s been the experience of Sarah Turner, a junior at Central, who is planning to pursue an agricultural education degree at the University of Wyoming. Watching Cress’ patient and committed teaching style partly inspired that choice.\nAlthough her family owns a farm in Wheatland, living in Cheyenne doesn’t allow her to visit that farm every day like she does LCSD1’s school farm. So, Cress helped Turner come up with the money to buy two pigs she keeps at the school farm.\nHe’s shown her the ropes of presenting animals at 4-H competitions and has become one of her favorite teachers.\n“He’s not just an everyday teacher,” said Turner, who admires Cress’ patience and commitment to his students’ education. “Cress is someone I can look up to. He’s both competitive and compassionate.”", "url": "https://starherald.com/news/state-and-regional/students-look-up-to-wyoming-high-school-ag-program-teacher/article_116cc608-d9fa-54b4-aad1-bb6079918a33.html", "date_published": "2021-05-23 13:00:00"}